[
    {
        "title": "Deno 2.0 looks toward backward compatibility to move forward",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/deno_20_now_plays_nicer/",
        "body": [
            "Deno, the runtime for JavaScript and TypeScript, reached version 2.0 on Wednesday, bringing with it baggage from the past in the form of broad Node.js compatibility.",
            "The project debuted in May 2020 when Ryan Dahl attempted to address problems he saw with Node.js, the JavaScript runtime he released in May 2009 and which he later admitted included “design mistakes made that just cannot be corrected now because there's so much software there that uses it.”",
            "JavaScript's traditional runtime environment was the web browser. Node.js is a runtime environment that allows JavaScript code to execute without a browser – on a server, for example.",
            "Deno represents an attempt to address the shortcomings of Node.js and deliver \"a modern, all-in-one, zero-config toolchain for JavaScript and TypeScript development,\" as described by Dahl, Bert Belder, Bartek Iwańczuk, and Andy Jiang, in a blog post.",
            "Deno is written in Rust and based on the V8 engine that powers Chromium browsers. \"Rust has been crucial to Deno’s development, especially with Rusty V8, recently stabilized,\" Dahl told The Register. \"Rust's unified build system simplifies adding third-party functionality compared to C++, keeping Deno fast and reliable for server-side apps.\"",
            "The long-awaited version 2.0 milestone is backward compatible with Node.js and npm – a feat prior versions did not achieve.",
            "\"Deno 2.0 understands package.json , the node_modules folder, and even npm workspaces, allowing you to run Deno in any Node project using ESM,\" explain Dahl, Belder, Iwańczuk, and Jiang.",
            "The runtime also supports various popular web frameworks like Angular, Astro, Next.js, QwikCity, Remix, and SvelteKit.",
            "Deno itself is now a package manager, along the lines of npm. Using the deno install command, developers can install project dependencies. For those using a package.json file, it will create a node_modules folder. Otherwise, it will store dependencies in the global cache. And as their names suggest, the deno add and deno remove commands allow packages to be added or removed from package.json or deno.json files.",
            "Among other noteworthy features, Dahl pointed to the stabilized standard library, support for private npm registries, workspaces and monorepo support, long term support (LTS) release, and the JSR registry for sharing JavaScript libraries across runtimes.",
            "He also called out Deno's speed, particularly in the context of cold starts when invoking functions in AWS Lambda.",
            "While Deno adoption trails Node.js, Dahl said usage is growing. \"With 2.0’s broader compatibility and new features, we expect growth to continue,\" he said. \"It makes trying Deno easier for node developers while keeping a modern, secure experience.\"",
            "Bun, a rival runtime, reached 1.0 last year, and Dahl said he welcomed the challenge.",
            "\"Bun is a competitor – but competition in this space is healthy,\" he said. \"It pushes us all to improve the language and ecosystem. Unlike bun, Deno’s goal isn’t to be a node clone in Rust or a drop-in replacement – rather we aim to advance JavaScript beyond 2010-era CommonJS and narrow the gap between server-side and browser environments.",
            "\"We believe JavaScript can evolve beyond mismatched tooling and endless layers of transpilation. Our vision includes native TypeScript support, built on web standards like promises, top-level await, wasm, fetch, and ES modules, all in a single, dependency-free executable. Deno is secure by default, like the web.\" ®"
        ],
        "publishing_date": "2024-10-09 22:35",
        "keywords": [
            "JavaScript",
            "Security",
            "Software"
        ]
    },
    {
        "title": "How smart TVs spy on you and harvest data",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/smart_tv_spy_on_viewers/",
        "body": [
            "Smart TVs are watching their viewers and harvesting their data to benefit brokers using the same ad technology that denies privacy on the internet.",
            "In a report titled \"How TV Watches Us: Commercial Surveillance in the Streaming Era,\" the Center for Digital Democracy (CDD) outlines the expansive \"commercial surveillance system\" that has infested Smart TVs – aka connected TVs or CTVs – and video streaming services.",
            "\"The US CTV streaming business has deliberately incorporated many of the data-surveillance marketing practices that have long undermined privacy and consumer protection in the 'older' online world of social media, search engines, mobile phones and video services such as YouTube,\" the report [PDF] declares.",
            "\"Millions of Americans are being forced to accept unfair terms in order to access video programming, which threatens their privacy and may also narrow what information they access – including the quality of the content itself.\"",
            "The report calls out the proliferation of FAST (Free Advertiser-Supported TV) channels like Tubi which, through its Tubi360 brand and content studio, \"enables marketers to engage in enhanced product placement by incorporating their brands directly into programming content to target individual viewers.\"",
            "It also catalogs various mechanisms used for profiling viewers and presenting them with personalized ads. These include: cookieless IDs; identity graphs that combine various IDs to link activity across devices and locations; automatic content recognition (ACR) software that analyzes what's on-screen; and AI-based ad targeting that \"analyzes a scene's text, images, and sentiment, determines an emotional score, and then places ads with a similar emotional score.\"",
            "\"CTV has become a privacy nightmare for viewers,\" lamented Jeff Chester, executive director of CDD and co-author of the report, in a statement. \"It is now a core asset for the vast system of digital surveillance that shapes most of our online experiences.\"",
            "The CDD has presented its report to the US Federal Trade Commission, Federal Communications Commission, and California privacy regulators in the hope these watchdog agencies will do something about an issue that has been simmering for years.",
            "The FTC, for example, held a Smart TV Workshop in 2016 to explore the issue. \"In 2016, virtually all television delivery systems – smart TVs, streaming devices, game consoles, apps, and even old-fashioned set top boxes – track consumers' viewing habits, and sometimes in new and unexpected ways,\" the agency noted at the time.",
            "The following year, the agency settled with CTV maker Vizio for $2.2 million over allegations that its smart TVs \"capture second-by-second information\". Info captured included videos viewed, which were allegedly matched to \"specific demographic information to the viewing data, such as sex, age, income, marital status, household size, education level, home ownership, and household value.\" The combined data set is then sold to third parties for ad targeting.",
            "In 2021, at the FTC's PrivacyCon, academic researchers presented a paper [PDF] titled \"The TV is Smart and Full of Trackers: Measuring Smart TV Advertising and Tracking.\" Among other findings, the researchers noted that some smart TV apps \"send the advertising ID alongside static PII [personally identifiable information] values, effectively eliminating the user's ability to opt out of ad personalization.\"",
            "So this is not exactly a new issue. And as is the case with social media privacy controls, consumers often don't understand how to limit CTV tracking to the extent that's actually possible.",
            "In this hope that something will change after years of hand waving, CDD has written letters to officials at the FTC [PDF], FCC [PDF], the California Privacy Protection Agency [PDF], and California attorney-general Rob Bonta [PDF] to remind them that CTVs appear to flout privacy rules.",
            "Asked if there's a reason the CDD expects its latest entreaty to prompt action from the regulators after almost a decade of concerns about CTVs, Chester told The Register that the various agencies responded very favorably.",
            "\"I do not believe they knew the extent of it,\" he replied. \"Now they do. Besides, and as you know, CTV and adtech connected practices have mushroomed in the last three to four years. We are at a different place than in 2016.\"",
            "Indeed, data brokers are spending increasing amounts on lobbying to dilute or derail privacy bills.",
            "For its part, the FTC appears to be aware of the problem, having just last month issued its own report expressing concern about rampant data grabbing among social media and video streaming corporations.",
            "Still, the US does not have a federal data privacy law – much less a plan to bring deep-pocketed data snoops and sellers to heel. ®"
        ],
        "publishing_date": "2024-10-09 22:15",
        "keywords": [
            "Hardware",
            "Law",
            "Privacy"
        ]
    },
    {
        "title": "Marriott settles for $52M after years-long breaches",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/marriott_settlements_data_breaches/",
        "body": [
            "Marriott has agreed to pay a $52 million penalty and develop a comprehensive infosec program following a series of major data breaches between 2014 and 2020 that affected more than 344 million people worldwide.",
            "This comes as a result of two settlements announced today: one involving a coalition of 49 state attorneys general and the District of Columbia, which had launched an investigation after network intruders stole sensitive customer information, including some financial details. The $52 million will be distributed among all 50.",
            "The second settlement [PDF], reached with the US Federal Trade Commission, will require Marriott International and its subsidiary Starwood Hotels and Resorts Worldwide to, among other things, implement better cybersecurity practices and certify compliance to the FTC for 20 years, plus provide customers an easy way to tell the hotel chains to delete their personal information collected.",
            "Per usual, in agreeing to the settlements, \"Marriott makes no admission of liability with respect to the underlying allegations,\" according to a statement on the hotel's website and both agreements.",
            "\"As part of the resolutions with the FTC and the State Attorneys General, Marriott will continue implementing enhancements to its data privacy and information security programs, many of which are already in place or in progress,\" the statement continued.",
            "\"For example, Marriott is offering US customers a process to request deletion of their personal information, offering an online portal for Marriott Bonvoy members to report potentially suspicious loyalty account activity, and implementing a multi-factor authentication option for Marriott Bonvoy accounts,\" it added.",
            "Both of the investigations stemmed from a series of network intrusions between 2014 and 2020 across Marriott, which manages more than 7,000 properties globally and Starwood, which Marriott acquired in 2016.",
            "The first breach involved payment card info belonging to more than 40,000 Starwood customers, according to the FTC's proposed complaint [PDF].",
            "Four days after Marriott announced it had bought Starwood, the subsidiary notified customers that data thieves had spent 14 months on its network, beginning in June 2014, when they snarfed up customers' names and card numbers before being booted off the systems.",
            "The second breach began around July 2014, and went undetected for more than four years, until September 2018. This one involved the theft of more than 339 million Starwood guest account records, including 5.25 million unencrypted passport numbers.",
            "A third breach, beginning in September 2018, affected Marriott's network and took almost two years to detect — this one wasn't spotted until February 2020. This gave the intruders plenty of time to steal names, physical and email addresses, phone numbers, month and day of birth, and loyalty account information belonging to 1.8 million Americans.",
            "All of these breaches were made possible by Marriott and Starwood's allegedly non-existent security, which, according to the complaint, included poor password management and access control practices, shoddy network segmentation and software patching procedures, multi-factor authentication that wasn't turned on in all instances, and inadequate log and network monitoring.",
            "To resolve these complaints — and, again, without admitting any guilt — Marriott has agreed to pay the US states and Washington, DC $52 million. To put this in perspective: the global hotel giant raked in about $23.71 billion in revenue in 2023. So it's not going to miss the $52 million distributed among the states.",
            "Plus, it also agreed to implement a series of practices designed to improve its data security and minimize the info it collects from customers. This includes only retaining personal information for as long as is necessary to fulfill the purpose for which it was collected.",
            "Both companies will also provide a link where customers can tell the hotels to delete any personal information associated with their email or loyalty rewards program account number.",
            "Additionally, under the agreements, Marriott and Starwood are required to establish an information security program that will undergo an independent, third-party assessment every two years. This, among other things, includes using MFA, network segmentation and data encryption.",
            "And finally, the companies must provide a method for consumers to request a review of unauthorized activity in their Marriott Bonvoy loyalty rewards accounts. Marriott has also pledged to restore any loyalty points stolen by cybercriminals. ®"
        ],
        "publishing_date": "2024-10-09 21:08",
        "keywords": [
            "FTC",
            "Security"
        ]
    },
    {
        "title": "Earth is in the path of another strong solar storm",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/g4_solar_storm/",
        "body": [
            "Watch out, Earth: There's another strong geomagnetic storm headed our way from the Sun, following the G5-class one that hit back in May.",
            "The US National Oceanic and Atmospheric Administration's Space Weather Prediction Center (SWPC) warned today that a coronal mass ejection (CME) detected on October 8 is moving fast - somewhere between 1,200 and 1,300 kilometers per second - and will likely strike Earth sometime early tomorrow, October 10.",
            "According to SWPC, the storm has the potential to reach G4 levels upon its arrival, putting it at just shy of the G5 maximum for geomagnetic storms.",
            "At G4 strength, the center noted effects may include widespread voltage control problems, interference with spacecraft operations, aurora borealis at lower altitudes than expected, and interruption to terrestrial communications.",
            "Along with the G4 storm, the SWPC said the CME headed for Earth will also bring with it an S3-level solar radiation storm, which could harm astronauts and passengers on high-flying aircraft, disrupt solar panel efficiency, and degrade radio and navigation signal propagation. An R3-level radio blackout is also expected from the CME that originated with yesterday's X1.8 solar flare (relatively low in strength, but potentially disruptive due to its direct path toward Earth), potentially causing loss of high-frequency radio and degradation of low-frequency signals that could last for tens of minutes.",
            "It's been a busy year for our star, with a massive X6.3 solar flare in February, and Earth being hit by a G5-level geomagnetic storm in May. If you're hoping things will calm down in the near future - sorry, we still have some more solar activity to endure.",
            "We're approaching the peak of solar cycle 25, which began in December 2019 and is expected to peak next July. The NOAA previously predicted that cycle 25 would be a relatively calm one, but said during a press briefing today that it's already revised its prediction upward given the previous May storm. Instead of predicting between 137 and 166 sunspots (which give birth to CMEs), the SWPC believes we'll see between 165 and 186 of them.",
            "\"We have a good number [of G4 events] through the maximum of a solar cycle,\" SWPC service coordinator Shawn Dahl said during the briefing. G5-level storms, however, are rare. The October CME has the potential to reach G5, Dahl said, and if it does that would mark a rare moment when two G5 storms occurred within months of each other.",
            "\"We went through the entire previous cycle without reaching G5,\" Dahl noted. The May event, Dahl said, was the first G5 storm since 2003.",
            "The SWPC said it won't know the storm's true strength until it gets within one million miles of Earth, which is expected early tomorrow, about 15 to 30 minutes before reaching Earth.",
            "But while this storm has the potential to be worse than our previous brush with a CME, Dahl said it likely won't reach the severity of the May storm.",
            "\"During the one in May, we had a series of CMEs that swept everything together and enhanced the effect,\" Dahl said. \"This time we only have one.\"",
            "The peak of solar activity in this busy cycle is coming next year, but that doesn't mean the solar maximum is over, Dahl said. Storms after the peak of a solar maximum can be even worse than earlier ones because of the position of sunspots.",
            "Early in a maximum, sunspots form closer to the Sun's poles before slowly migrating toward its equator. We still have around ten degrees to go before the Sun's many spots reach the equatorial region, Dahl said.",
            "In short, we'll likely see plenty of storms, and southerly auroras, in the next year, but this one might be a slight disappointment for space weather watchers. Either way, keep an eye on the SWPC space weather forecast tomorrow morning to ensure this one won't disrupt your day. ®"
        ],
        "publishing_date": "2024-10-09 20:15",
        "keywords": [
            "Science",
            "Space"
        ]
    },
    {
        "title": "National Public Data files for bankruptcy after info leak",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/national_public_data_bankrupt/",
        "body": [
            "The Florida business behind data brokerage National Public Data has filed for bankruptcy, admitting \"hundreds of millions\" of people were potentially affected in one of the largest information leaks of the year.",
            "In June, the hacking group USDoD put a 277.1 GB file of data online that contained information on about 2.9 billion individuals, and asked $3.5 million for it. The data came from National Public Data - a data brokerage owned by Jerico Pictures - which offered background checks to corporate clients via its API.",
            "NPD confirmed it had been hacked in an attack on December 2023 and initially said just 1.3 million people had lost personal details, such as \"name, email address, phone number, social security number, and mailing address(es).\" But in the court documents filed for bankruptcy, the business concedes the total is much higher.",
            "\"The debtor is likely liable through the application of various state laws to notify and pay for credit monitoring for hundreds of millions of potentially impacted individuals,\" the bankruptcy petition [PDF] from Jerico Pictures states.",
            "\"As the debtor’s schedules indicate, the enterprise cannot generate sufficient revenue to address the extensive potential liabilities, not to mention defend the lawsuits and support the investigations. The debtor’s insurance has declined coverage.\"",
            "According to the filing, the organization is facing more than a dozen class-action lawsuits over the data loss and potential \"regulatory challenges\" from the FTC and more than 20 US states. Any plaintiffs will have a hard time getting any money out of Jerico, however, since the documents state the business has very limited physical assets.",
            "In the accounting document [PDF], the sole owner and operator, Salvatore Verini, Jr, operated the business out of his home office using two HP Pavilion desktop computers, valued at $200 each, a ThinkPad laptop estimated to be worth $100, and five Dell servers worth an estimated $2,000.",
            "It lists $33,105 in a corporate checking account in New York as its assets, although the business pulled in $1,152,726 in the last financial year, and estimates its total assets are between $25,000 and $75,000 in total.",
            "It also lists 27 domains with a value of $25 apiece. These include the corporate website - now defunct - as well as a host of other URLs including criminalscreen.com, RecordsCheck.net, and asseeninporn.com.",
            "This isn't the first time a data brokerage has been hacked and it won't be the last, we're told.",
            "The National Public Data incident shows the need for clear state and local laws on data privacy Lena Cohen, staff technologist for the EFF, told The Register. \"The data broker industry is the wild west of unregulated surveillance,\" she said. \"It's a vast, interconnected, opaque industry with 100s of companies people have never heard of making billions of dollars per year. Without strong privacy legislation individuals face an uphill battle sorting things out in cases like this.\"",
            "Without strong privacy laws, companies in the sector have every incentive to collect as much personal data as possible and very little to actually protect it, she commented. These would be useful on a federal level but even those states with privacy laws in statute books have difficulty enforcing them.",
            "There was no comment from Mr. Verini at the time of publication. ®",
            "Editor's note: This story was amended post-publication with comment from the EFF."
        ],
        "publishing_date": "2024-10-09 19:30",
        "keywords": [
            "Database",
            "Privacy",
            "Security"
        ]
    },
    {
        "title": "Nobel Prize for chemistry goes to ... AI, again",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/alphafold_rosetta_nobel_chemistry_prize/",
        "body": [
            "This year's Nobel Prizes are shaping up to be a triumph for AI. After awarding the physics prize to early AI pioneers yesterday, the chemistry prize has now gone to the creators of AI protein prediction platform AlphaFold and protein design tool Rosetta.",
            "DeepMind cofounder and CEO Demis Hassabis and director John Jumper will share half of the Nobel Prize in Chemistry for their work on AlphaFold models. The second generation can predict almost all known protein structures - more than 200 million in total.",
            "\"The team trained AlphaFold2 on the vast information in the databases of all known protein structures and amino acid sequences and the new AI architecture started delivering good results,\" the Nobel committee said [PDF].",
            "When it entered the 2020 Critical Assessment of Protein Structure Prediction (CASP) competition, AlphaFold2 performed almost as well as X-ray crystallography (the prior gold standard in modeling protein structures) \"in most cases,\" the committee added. \"Previously, it often took years to obtain a protein structure, if at all. Now it can be done in a few minutes.\"",
            "Jumper, who came to DeepMind after the Google subsidiary had already built the initial AlphaFold that improved on prior CASP results but was still only about 60 percent accurate, was essential to DeepMind 2's success, the Nobel body said.",
            "\"AlphaFold2 was coloured by Jumper's knowledge of proteins,\" the committee explained. \"The team also started to use the innovation behind the recent enormous breakthrough in AI: neural networks called transformers.\"",
            "So maybe some additional AI tech helped, too.",
            "Although AlphaFold has been fundamental in helping humans become better predictors of protein shapes, which play a critical role in their function, it can't develop drugs or make anything new.",
            "That's where Rosetta, designed by University of Washington biochemistry professor David Baker, comes in.",
            "Baker developed his own protein prediction software, dubbed Rosetta, in the 1990s, and when it entered the CASP competition in 1998, it did well \"in comparison to other participants,\" the Nobel committee said. After the competition, Baker and his team got the idea to use the software in reverse: Instead of using amino acid sequences to predict the shape of a protein, they began experimenting on whether inputting the shape of a desired protein would suggest an amino acid sequence to create it.",
            "Lo and behold, it worked perfectly and led to the creation of Top7, \"the first protein that was entirely different to all other known existing proteins,\" according to the Nobel folks.",
            "Proteins are fundamental to understanding biochemistry and are involved in the creation of biological structures like muscles, as well as chemicals like hormones and antibodies. By enabling the creation of new proteins, humans can do all sorts of things.",
            "\"This can lead to new nanomaterials, targeted pharmaceuticals, more rapid development of vaccines, minimal sensors and a greener chemical industry – to name just a few applications,\" the committee said.",
            "The chemistry Nobel being awarded for AI development marks the second time this year. The Nobel in physics was awarded yesterday to John Hopfield for his work developing early neural networks, and to AI godfather Geoffrey Hinton for giving machines the ability to interpret information they're trained to recall.",
            "Three Nobels have been awarded so far this year; the first, for physiology and medicine, went to Victor Ambros and Gary Ruvkun for the discovery of microRNA, which regulates gene expression and protein production. Nobel prizes for literature and peace have not yet been handed out. ®"
        ],
        "publishing_date": "2024-10-09 18:29",
        "keywords": [
            "AI",
            "Deepmind",
            "Science"
        ]
    },
    {
        "title": "US DoJ intervenes in Realtek lawsuit against MediaTek",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/doj_intervenes_realtek_mediatek/",
        "body": [
            "Taiwanese chip firm MediaTek is under scrutiny with the US Department of Justice (DoJ) taking an interest in an antitrust dispute with semiconductor compatriot Realtek.",
            "MediaTek, a fabless chip company targeting smartphones, wireless comms, and other applications, is the subject of a lawsuit from Realtek launched last year, which alleges that its rival conspired with \"patent trolls\" to file meritless infringement cases against it.",
            "Those patent infringement cases centered on chips used in television sets, for which MediaTek is understood to have in excess of a 70 percent market share.",
            "In a court filing [PDF] on October 4, the DoJ says that it has submitted a Statement of Interest on behalf of the United States to underscore the \"anticompetitive potential and the unprecedented nature\" of the litigation bounty agreement claimed by Realtek in its complaint.",
            "\"Courts reviewing the underlying patent claims have already expressed alarm upon seeing the bounty provision, stating it is improper and should be discouraged as a matter of public policy,\" the document states.",
            "Realtek alleged in its original complaint that MediaTek was paying a patent assertion company a \"secret bounty\" to file patent litigation cases in the US courts, with the intent of harassing Realtek and causing it to divert resources away from product development.",
            "The chip designer named Future Link Systems LLC as the patent assertion company in question, as well as the outfit's parent company, IPValue Management, in the complaint, labeling the pair as \"patent trolls.\"",
            "Realtek alleged that it discovered this arrangement during the discovery process relating to one of the patent infringement cases, when it uncovered a license agreement between MediaTek, IPValue, and Future Link that included the litigation bounty provision.",
            "The firm alleges that following the bounty agreement, the patent assertion companies filed six baseless infringement suits, four of them against Realtek and a further two against Amlogic, another TV chip competitor.",
            "However, the defendants filed a motion to dismiss the case, claiming that the Noerr-Pennington doctrine barred Realtek's claims, arguing that the entire allegedly anticompetitive conduct of the companies is \"incidental to protected petitioning activity.\"",
            "This is where the DoJ gets involved: Its filing states that Realtek's complaint sufficiently alleges that the serial lawsuits filed by the patent assertion companies are a sham. If true, this would mean that the bounty agreement does not merit Noerr-Pennington protection, or so the argument goes.",
            "Even if the patent cases are not shams, however, the bounty agreement is \"not petitioning or incidental to petitioning,\" and the DoJ warns that \"exemptions from the antitrust laws should be construed narrowly,\" calling for hesitation before applying these on a motion to dismiss.",
            "Going further, the DoJ filing states: \"If defendants' arguments are accepted, Noerr-Pennington would be improperly applied to protect well-pleaded serial sham petitioning activity from discovery and exempt anticompetitive activity unrelated to petitioning. A ruling in defendants' favor would improperly expand Noerr-Pennington to protect run-of-the-mill anticompetitive activity.\"",
            "The filing concludes: \"For the reasons above, we urge this Court (i) to hold that bounty provisions such as the one at issue should be scrutinized as a way to raise rivals' costs; and (ii) to avoid applying the Noerr-Pennington doctrine to protect the alleged anticompetitive bounty provision from antitrust scrutiny.\"",
            "In a statement to The Register, a spokesperson for Realtek commented: \"Realtek filed this case to fight against the abuses of patent trolls and a conspiring monopolist and the costs they impose on TV consumers everywhere. The DoJ's Statement of Interest confirms Realtek's case should move forward to discovery.",
            "\"The DoJ's statement makes clear that large companies cannot secretly hire patent trolls as litigation hit men to harm their smaller competitors. The United States' interest in this case is the same as Realtek – to protect consumers from abusive and anticompetitive practices.\"",
            "We asked MediaTek and IPValue Management for their reaction, and will update with any response. ®"
        ],
        "publishing_date": "2024-10-09 17:15",
        "keywords": [
            "Antitrust",
            "Patent",
            "Semiconductor"
        ]
    },
    {
        "title": "HBO doc names Bitcoin creator suspect - who says ‘not me’",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/satoshi_nakamoto_suspect_hbo_bitcoin/",
        "body": [
            "The man identified as Bitcoin creator Satoshi Nakamoto in a new HBO documentary has something to say: Wrong again, world.",
            "In the just-released HBO film on the history of the world's biggest digital currency - Money Electric: The Bitcoin Mystery - documentary filmmaker Cullen Hoback comes to the conclusion that the anonymous creator of Bitcoin was none other than a long-time member of the community and early Bitcoin developer Peter Todd.",
            "Todd dismissed the claim in the documentary, released yesterday, and denied it again when asked by The Register.",
            "\"[Hoback's] evidence for me being Satoshi is the same kind of coincidence-based, circumstantial thinking that fuels conspiracies like QAnon,\" Todd told us in an email. \"Which is ironic, given that [Hoback's] previous big project was a documentary on QAnon. He clearly didn't try to debunk his theories either.\"",
            "Hoback's previous project - Q: Into the Storm - aimed to unmask the person behind QAnon, perhaps giving him an interest in uncovering the identity of Satoshi Nakamoto. Todd, however, thinks Hoback was just trying to drum up interest in his new film.",
            "\"I think [Hoback] only included the Satoshi claim as a marketing ploy: he was really creating a documentary about Bitcoin, and needed a hook to get media attention,\" Todd said. \"He picked me to accuse mainly because I was an unlikely candidate, which helped drum up even more attention.",
            "\"I don't think he had any interest in finding the real truth.\"",
            "To be fair, the documentary does come off like a history of Bitcoin, its spread, and the key figures in its rise - Satoshi suspects among them. It includes interviews with a number of potential Satoshis, including Adam Back, inventor of Bitcoin predecessor Hashcash, who is painted in the film as the other most likely candidate to be the man behind Bitcoin. Clues that the film ultimately focuses on Nakamoto's identity are included throughout, but always as an added layer of uncertainty on top of something that's more about the transformation of analog currency into digital form.",
            "Todd even admits early in the film that people have suspected him of being Satoshi while denying the claim and simultaneously engaging in the frequent joke that \"Oh, I'm Satoshi,\" a line that's often bandied about amongst Bitcoin insiders engaging with the \"normies\" around them.",
            "\"You're pretty creative - you come up with some crazy theories,\" Todd told Hoback at the end of the film when confronted with the accusation that he's Nakamoto. \"It's ludicrous, but it is the sort of theory someone who spends their time as a documentary journalist would come up with.\"",
            "The key information in Hoback's documentary that links Todd to being Nakamoto comes from two items: A series of communications between Todd and an unidentified individual who called themselves \"John Dillon,\" claimed they worked in intelligence for the US government, and was advocating replace-by-fee (RBF) implementation for the Bitcoin blockchain. Todd later added RBF to the Bitcoin platform.",
            "Hoback claimed that Todd used Dillon as a pseudonymous mouthpiece to push his own ideas, the same thing he claims Todd did while masquerading on the BitcoinTalk forum as Nakamoto.",
            "Pointing to one of Todd's earliest posts on the forum - a direct response to Nakamoto's comment about transaction fees causing blockchain inputs and outputs not to match precisely - Hoback concludes that Todd accidentally logged into his new account under his real name, intending to answer as Nakamoto, since the post seemed to continue the same train of thought.",
            "However, Todd pointed to a comment on YCombinator by fellow early Bitcoin developer Greg Maxwell (also named in the documentary as a potential Nakamoto suspect), who notes that Todd's account was named \"retep\" at the time and wasn't renamed until later.",
            "\"If Satoshi had actually made that mistake, the obvious thing to do would be to just abandon the account. Not change the handle to your legal name a few years later,\" Todd said. \"[Hoback] could have easily fact checked this himself, or by asking us after the interview if the theory made any sense. But he didn't.\"",
            "At the end of the day, it's unlikely anyone will ever uncover the truth behind Nakamoto's identity - or, if they did, it's unlikely they could prove it, Todd said in the documentary.",
            "\"If I was Satoshi I would have destroyed my ability to prove I'm Satoshi, because then you'd never be tempted,\" Todd said early in the film. He told us that it was unlikely we'd ever know who Satoshi actually is, noting that \"hiding your identity when people aren't seriously looking for you isn't actually that hard,\" likely a dig at Hoback, who he said is deserving of ridicule for his conclusion in part because it puts a giant target on Todd's back.",
            "It's unknown how much Bitcoin Nakamoto has, but it's estimated that thousands of addresses linked to the unknown individual (or individuals) contain as much as 1.1 million BTC, worth close to $70 billion at current market rates.",
            "\"Falsely accusing an ordinary person of ordinary wealth of having tens of billions of dollars puts them at risk for obvious reasons,\" Todd told us. \"Cullen knows damn well he's putting my life in danger to promote his movie; I personally have had to do some emergency travel to reduce the risks to myself.\"",
            "Todd said that the community joke that everyone is Satoshi is in part to water down the risk to others. \"Everyone in the Bitcoin community knows this,\" he said.",
            "At the end of the film, Todd appears visibly agitated at being directly accused of being Nakamoto. In response, he sarcastically claims that he is not only Satoshi, but also Craig Wright [who claimed to be Nakamoto, but was proven not to be], which he later told us he did to ridicule Hoback's claims.",
            "\"This is going to be very funny when you put this into the documentary and a bunch of Bitcoiners watch it,\" Todd said at the end of the film. His being accused, he said, will thrill the Bitcoin community because it's \"yet another example of journalists really missing the point in a way that's really funny.\"",
            "\"The point is to make Bitcoin the global currency, and people like you being distracted by nonsense can potentially do good on that,\" he added.",
            "For anyone interested in watching the HBO documentary, it's available now, and is an interesting look at the history of Bitcoin and its rise as a global influence. As to whether it actually unmasked Nakamoto - we're just as close to knowing the truth as we were two days ago, really. ®"
        ],
        "publishing_date": "2024-10-09 17:00",
        "keywords": [
            "Bitcoin",
            "Cryptocurrency"
        ]
    },
    {
        "title": "CIQ takes Rocky Linux corporate with $25K price tag",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/rocky_linux_from_ciq/",
        "body": [
            "CIQ has unveiled a version of Rocky Linux backed by service level objectives and indemnities for enterprises requiring more than the support of an enthusiastic community behind an operating system.",
            "Starting from $25,000 for an annual subscription, Rocky Linux from CIQ (RLC) retains its compatibility with Red Hat Enterprise Linux (RHEL) as well as its community origins, but adds service level objectives (SLOs) for CVE remediation and security updates, legal indemnification protections to deal with potential infringement claims related to open software in the distribution, and supply chain validation for packages. Support is available separately.",
            "Gregory M Kurtzer, founder and CEO of CIQ and founder of Rocky Linux, said: \"Rocky Linux from CIQ meets the needs of organizations who want to run community Rocky Linux within their IT infrastructure but need contractual guarantees and mitigation to liabilities that the open source community cannot provide. Now you can have the best of both worlds.\"",
            "Rocky Linux is one of several enterprise Linux distributions to arise from Red Hat's decision to change the focus of CentOS – a community build of RHEL – to a development branch of RHEL, thus making it unsuitable for production workloads. A 2023 decision to stop making RHEL source code available to non-customers compounded the issue and resulted in the formation of the Open Enterprise Linux Association (OpenELA).",
            "At the time, Kurtzer said: \"With OpenELA, CIQ, Oracle, and SUSE join forces with the open source community to ensure a stable and resilient future for both upstream and downstream communities to leverage Enterprise Linux.\"",
            "Another RHEL-compatible distribution available to enterprises is AlmaLinux, although its community-driven nature might give administrators pause. That said, the organization readily directs users to companies that can provide commercial support for the product, backed by service level agreements (SLAs).",
            "CIQ's introduction of RLC is at once reassuring for enterprises looking for RHEL and CentOS alternatives – CentOS 7 moved out of maintenance support in June 2024, although SUSE will keep the lights on a little longer – and a further sign of the fragmentation of the enterprise Linux world following Red Hat's decisions.",
            "However, for administrators who have gone down the Rocky Linux path, the arrival of RLC will provide both compliance and comfort – at a cost. ®"
        ],
        "publishing_date": "2024-10-09 16:02",
        "keywords": [
            "CentOS",
            "Enterprise",
            "Linux"
        ]
    },
    {
        "title": "Windows restart issues fixed with Patch Tuesday update",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/windows_patch_tuesday_fixes/",
        "body": [
            "Microsoft says that the problems with the Windows 11 Patch Tuesday preview have now been resolved.",
            "The non-security update preview, KB5043145, released at the end of September did not perform well for all users. Several reported issues with multiple restarts, blue or green screens, or the Automatic Repair tool opening after installing the update.",
            "According to Microsoft, the restart issue has been dealt with and is listed as fixed in the known issues list for the original patch.",
            "The problem facing administrators is that the security fixes released in yesterday's Patch Tuesday update are important. One addressed a remote code execution flaw already being exploited, though it required the victim to install a file locally.",
            "However, as Microsoft wrote in the release notes for Patch Tuesday's fix, the update included all the \"improvements\" that featured in September's preview. But that's OK – multiple restarts following the installation of the September preview have been fixed.",
            "The issue that caused the restarts also caused USB and Bluetooth connections to fail for some devices. Again, this should be fixed in the Patch Tuesday release. However, Microsoft advised users who have installed the earlier update to make use of a Known Issue Rollback (KIR) or a Group Policy to deal with the problem.",
            "The Patch Tuesday release was also significant for Home and Pro users of Windows 11 22H2 since it was the last they would receive as that edition dropped out of servicing. Enterprise and Education editions have until next year, when they too will reach the end of servicing. Windows 10 will also reach the end of its life cycle at the same time.",
            "October 8 also marked when the remaining editions of Windows 11 21H2 reached the end of security updates; Home and Pro went out of support in 2023. ®"
        ],
        "publishing_date": "2024-10-09 15:14",
        "keywords": [
            "Microsoft",
            "Operating System",
            "Software"
        ]
    },
    {
        "title": "Cognizant guilty of discriminatory conduct, US jury finds",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/us_jury_cognizant_case/",
        "body": [
            "A US jury has found that employment practices at Cognizant constitute discriminatory conduct toward non-Indian workers in a case that originated in 2013 and claimed the tech giant favored H-1B visa holders from India over local workers.",
            "Last week's verdict [PDF] says the IT service giant should pay punitive damages. It followed Cognizant's failed attempt to have a federal judge dismiss a 2017 class action lawsuit alleging bias on the grounds of race and nationality after a previous trial ended without the jury reaching a verdict.",
            "The US-based tech outsourcing and consultancy firm denies the claims. A spokesperson for Cognizant told The Register it was disappointed with the latest verdict and plans to vigorously defend itself on appeal.",
            "\"We provide equal employment opportunities for all employees and have built a diverse and inclusive workplace that promotes a culture of belonging in which all employees feel valued, are engaged and have the opportunity to develop and succeed. Cognizant does not tolerate discrimination and takes such claims seriously,\" they said.",
            "The spokesperson pointed out that the Christy Palmer v. Cognizant complaint [PDF] was filed in 2017 and addresses claims dating back to 2013.",
            "Those bringing the case alleged that Cognizant engaged in employment practices or patterns that favored South Asian employees based on nationality and race to the detriment of other workers. They allege these practices are against US civil rights law.",
            "In the 2017 complaint, the plaintiffs said only about 12 percent of the US IT industry is South Asian, while at least 75 percent of Cognizant's US workforce is South Asian, primarily from India.",
            "Cognizant hires people then allocates them to client work. When those client jobs come to an end, they can be placed on the \"bench\" to wait to be allocated to another client project.",
            "The allegations state that Cognizant maximized the number of H-1B visas it applied for in the lottery by allegedly claiming it needed to fill jobs that effectively did not exist.",
            "\"Cognizant's explicit preference to staff visa holders in US positions minimizes or eliminates competition for the jobs from non-South Asians residing in the US. Similarly, 'visa ready' individuals often are used to replace non-South Asians working for Cognizant in US positions. Non-South Asians are then disproportionately relegated to the bench, as jobs are given to visa-holding Indians,\" the complaint said.",
            "A Bloomberg report claimed Cognizant had the highest number of H-1B visas of any US employer from 2013 to 2019, according to Citizenship and Immigration Services.",
            "The allegation also maintains that Cognizant's firing policy also favors South Asians as it allegedly terminates employees who are on the \"bench\" for more than five weeks, and \"non-South Asians are benched at disproportionate rates compared to South Asians,\" or so the complaint claims. ®"
        ],
        "publishing_date": "2024-10-09 14:31",
        "keywords": [
            "Cognizant",
            "H-1B",
            "Legal"
        ]
    },
    {
        "title": "Trinity ransomware targets healthcare orgs",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/trinity_ransomware_targets_healthcare_orgs/",
        "body": [
            "At least one US healthcare provider has been infected by Trinity, an emerging cybercrime gang with eponymous ransomware that uses double extortion and other \"sophisticated\" tactics that make it a \"significant threat,\" according to the feds.",
            "The US Department of Health and Human Services sounded the alarm in an October 4 security advisory about the new crims on the block, first spotted in May. It also noted [PDF] that the Health Sector Cybersecurity Coordination Center (HC3) is \"aware of at least one healthcare entity in the United States that has fallen victim to Trinity ransomware recently.\"",
            "This appears to be Rocky Mountain Gastroenterology, which has been listed on the Trinity's leak site with the group claiming to have stolen 330 GB of data. The HHS warning indicates one of the gang's two healthcare victims is a US-based gastroenterology services provider.",
            "The Colorado-based clinics did not immediately respond to The Register's inquiries. However, as of Tuesday morning a banner across the company's website noted: \"We are currently experiencing technical issues, and our staff has limited availability to answer phone calls.\"",
            "In August, Trinity claimed to have stolen 3.63TB of data belonging to Cosmetic Dental Group in the Channel Islands and threatened to publish it in September.",
            "The group's leak site also lists a law firm in Florida and Georgia, and has claimed responsibility for attacking orgs in the UK, Canada, China, the Philippines, Argentina and Brazil.",
            "Trinity, like most ransomware gangs these days, uses double extortion in its attacks – meaning it steals sensitive data before locking up the victim's files, and then threatens to leak the private data if the org doesn't pay up. This turns up the heat on the infected groups and increases the likelihood that they will pay a ransom to the extortionists.",
            "It's believed that the criminals gain initial access by exploiting flaws in unpatched software, sending phishing emails with malicious attachments or links, or compromising remote desktop protocol (RDP) endpoints with weak or stolen credentials. In other words, all of the tricks that criminals use to break into victims' networks.",
            "The malware itself – also called Trinity – shares similarities with two other types of ransomware: 2023Lock and Venus.",
            "Both Trinity and Venus use the ChaCha20 encryption algorithm and similar registry values and mutex naming conventions. Trinity also shares code with 2023Lock ransomware, and uses an identical ransom note as that gang. Unfortunately, no known Trinity decryption tools exist.",
            "Since this is just one of the many new crews exploding onto the ransomware scene and specifically targeting hospitals and other healthcare organizations, it's a good idea to heed HHS's advice in order to prevent ransomware infections in the first place and also recover more quickly in the event of an attack.",
            "Implement a recovery plan that includes retention of multiple copies of sensitive data and servers in physically separate and secure locations. Also, use network segmentation and offline backups to limit the criminals' movement and interruptions to business.",
            "To protect against phishing attacks, consider adding an email banner to emails received from outside your organization and disabling hyperlinks in received emails.",
            "Turn on multifactor authentication (MFA) and consider using this to better secure Remote Desktop Protocol (RDP) access while also placing RDP behind a Virtual Private Network (VPN). ®"
        ],
        "publishing_date": "2024-10-09 13:45",
        "keywords": [
            "Cybercrime",
            "Ransomware",
            "Security"
        ]
    },
    {
        "title": "DoJ considering breaking up Google in antitrust case",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/usa_vs_google_proposed_remedies/",
        "body": [
            "The US government has confirmed it is considering asking a judge to force Google to divest parts of its business as part of potential remedies in the antitrust case over its control of online searches.",
            "In a proposed remedy framework [PDF] it filed yesterday, the Department of Justice's antitrust division laid out the various ways it might tackle what it calls Google's anticompetitive conduct in general search services and general search text advertising. The move follows the federal Judge Amit Mehta's ruling in August that the company does have a monopoly in areas such as search on mobile phones, and has acted to maintain that monopoly.",
            "Yesterday's filing states that the government is considering \"behavioral and structural remedies that would prevent Google from using products such as Chrome, Play, and Android to advantage Google search and Google search-related products and features… over rivals or new entrants.\"",
            "\"Structural remedies\" in cases such as these typically refers to the breaking up of a company into smaller businesses, or divestment of particular assets. In this specific case, that might mean Google's Chrome browser or its Android mobile operating system.",
            "Google today characterized the move as \"government overreach,\" and as \"radical and sweeping proposals\" it said would hurt developers and consumers, referring The Register to its statement. It added: \"We believe that today's blueprint goes well beyond the legal scope of the Court's decision about Search distribution contracts. Government overreach in a fast-moving industry may have negative unintended consequences for American innovation and America's consumers. We look forward to making our arguments in court.\"",
            "If the watchdog were to move forward with these remedies – and the court were to approve them – it would be the biggest antitrust breakup of a US company since ‎ United States v. AT&T in 1982. AT&T Corp was forced to agree to break up its American business into seven small units dubbed \"Baby Bells.\" That divestiture took two years and was completed in 1984.",
            "Those are big ifs, however. When it comes to the likelihood it will move forward with divestment and the court will agree, many will refer to exhibit: USA vs Microsoft Corp.",
            "\"As the Court recognized, Google's longstanding control of the Chrome browser, with its preinstalled Google search default, significantly narrows the available channels of distribution and thus disincentivizes the emergence of new competition,\" the DoJ's filing notes, adding that \"Google Play Store is a must-have on all Android devices,\" and that the Android Agreements \"are a critical tool for Google's anticompetitive limitations on distribution.\"",
            "The DoJ goes on to claim it has \"a duty to seek – and the Court has the authority to impose – an order that not only addresses the harms that already exist as a result of Google's illegal conduct, but also prevents and restrains recurrence of the same offense of illegal monopoly maintenance going forward.\" This might be interpreted as implying that structural remedies are required because behavioral remedies are often regarded as less effective and more difficult to enforce.",
            "Within the proposed remedy framework, the DoJ says it is considering remedies to address four categories of harms related to Google's conduct, comprising search distribution and revenue sharing; generation and display of search results; advertising scale and monetization; and accumulation and use of data.",
            "For each area, the remedies deemed necessary to prevent monopoly behavior are said to include contract requirements and prohibitions; non-discrimination product requirements; data and interoperability requirements; and those structural requirements.",
            "The document states that the starting point for addressing the search giant's unlawful conduct is undoing its effects on search distribution, noting that most devices in the US come preloaded with Google search.",
            "Fully remedying these harms will require \"not only ending Google's control of distribution today, but also ensuring Google cannot control the distribution of tomorrow,\" the document notes with a sense of urgency.",
            "The DoJ is said to be evaluating remedies that would limit or prohibit preinstallation agreements and revenue-sharing arrangements for search and search-related products, and prevent the company from using products such as Chrome, Play, and Android to advantage its own Google search and related products and features.",
            "On the accumulation and use of data, the DoJ claims Google's \"unlawful behavior\" has enabled it to accumulate and use data at the expense of rivals. It says it is contemplating remedies that will somehow nullify this advantage by requiring the company to make available to others \"the indexes, data, feeds, and models used for Google search,\" and \"Google search results, features, and ads, including the underlying ranking signals, especially on mobile.\"",
            "With the generation and display of search results, the concern is that these often rely on \"websites and other content created by third parties, who have little-to-no bargaining power against Google's monopoly and who cannot risk retaliation or exclusion from Google,\" the document says.",
            "To address this, the government says it is considering leveling the playing field by requiring the Mountain View firm to allow websites crawled for Google search to opt out of training or appearing in any Google-owned AI product or feature.",
            "Finally, with advertising scale and monetization, the DoJ says that Google's monopoly has \"undermined advertisers' choice of search providers\" as well as the ability of rivals to monetize search advertising.",
            "The DoJ said it was also evaluating remedies that involve licensing or syndication of Google's ad feed independent of its search results, and allowing Google search advertisers to receive transparent and detailed information relating to search text ad auctions and ad monetization.",
            "As a measure of how seriously the antitrust watchdog is taking the enforcement of its remedies, it says it is considering asking the judge to require the Chocolate Factory to finance a court-appointed technical committee that would monitor its compliance and administer the remedies. It is also looking to designate a senior Google executive to be made regularly available to the court to report on the company's compliance.",
            "The government is set to provide the court with a further refined Proposed Final Judgement in November 2024, with Revised Proposed Final Judgment expected in March 2025. ®"
        ],
        "publishing_date": "2024-10-09 12:56",
        "keywords": [
            "Google"
        ]
    },
    {
        "title": "Microsoft sprinkles OneDrive with AI 'magic'",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/microsoft_onedrive_updates/",
        "body": [
            "Microsoft has unveiled a slew of new features for its OneDrive cloud storage service \"all through the magic of AI.\"",
            "Microsoft's AI assistant featured heavily in announcement. The Windows maker says Copilot in OneDrive is available now. The company first discussed new skills in Copilot for OneDrive in 2023. This time, it highlighted the use of the technology to summarize, compare, and \"get answers on specific files\" without having to open anything.",
            "Also moving from Coming Soon to Now Available are Colored OneDrive folders in Windows File Explorer, \"allowing you to personalize and organize your files with vibrant hues.\" Microsoft also promised updates to Document Libraries and a revamped sharing and collaboration experience.",
            "More interesting, however, are enhancements in search functionality. The company called the upgrades a \"game-changer\" with additional controls and improved results aimed at making it easier to find a specific file or folder, whether in the user's own OneDrive or a folder from a teammate. Microsoft said the search improvements were \"rolling out now\" and would be available to all commercial customers by the end of 2024.",
            "Administrators will also welcome upcoming previews of a site policy comparison report to ensure files meet compliance standards and Restricted Content Discoverability (RCD) – a critical feature for businesses considering rolling out Copilot. Files in libraries with the RCD policy configured won't appear in Copilot-generated results.",
            "While enterprises will be delighted to learn about the new features available now, as well as more coming to OneDrive in 2025, consumers will be more interested in the additional storage tiers. While it hasn't disclosed pricing, Microsoft will be adding 5 TB and 10 TB storage tiers by the end of the year. This is quite a step up from the existing 2 TB made possible in 2019, but a long way from the unlimited storage the company was offering a decade ago before pulling the deal a year later.",
            "Customers will need that extra storage as Microsoft is making images a priority in its mobile application. Alongside enhancements to photo editing and a new natural language search rolling out to Microsoft 365 subscribers now, due to hit all users during the summer of 2025, Microsoft is describing the redesigned app as \"a refreshed, photos-first mobile experience.\" The update is available on Android now, while iOS users have to wait until November.",
            "Microsoft's plans were generally well received, although some expressed concerns about the privacy implications of turning the Copilot AI loose on personal data. Microsoft was quick to respond that \"we take data privacy very seriously\" and personal data wouldn't be used to train its models.",
            "The Register asked Microsoft how much users should expect to pay for the new storage tiers and whether it might finally ditch the comparatively weedy 1 TB limit (especially considering the focus on photos). We will update this piece if any information is forthcoming. ®"
        ],
        "publishing_date": "2024-10-09 12:34",
        "keywords": [
            "Cloud Computing",
            "Microsoft",
            "Storage"
        ]
    },
    {
        "title": "UK Regulatory Innovation Office vows to slash red tape",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/uk_regulatory_innovation_office/",
        "body": [
            "Comment Over summer, the UK witnessed a change in government. However, the incoming Labour Party shares some ideas about regulation and innovation with its Conservative predecessor.",
            "Earlier this week, the Department for Science, Innovation & Technology (DSIT) launched the Regulatory Innovation Office (RIO), which it said would \"reduce the burden of red tape\" weighing down innovative companies. What kind of companies? Those that provide \"AI training software for surgeons to deliver more accurate surgical treatments for patients and drones which can improve business efficiency and quickly send critical deliveries to remote parts of the country,\" it said.",
            "The RIO aims to \"support regulators to update regulation, speeding up approvals, and ensuring different regulatory bodies work together smoothly.\" Its job is to tell the government of \"regulatory barriers to innovation ... set priorities for regulators which align with the government's broader ambitions, and support regulators to develop the capability they need to meet them and grow the economy.\"",
            "Science and technology secretary Peter Kyle said in a statement: \"By speeding up approvals, providing regulatory certainty, and reducing unnecessary delays, we're curbing the burden of red tape so businesses and our public services can innovate and grow, which means more jobs, a stronger economy, and a better quality of life for people across the UK.\"",
            "But haven't we been here before? A little more than two years ago, the previous Conservative government promised to carve a new data protection law that would unlock growth and save businesses around £1 billion ($1.3 billion) over the next ten years.",
            "\"We can't afford to stick with the status quo, to keep prioritizing process over results, and allowing unnecessary bureaucracy to stifle growth and innovation,\" said Nadine Dorries, who was digital and culture secretary at the time.",
            "The reform to GDPR, which the UK has inherited from its EU-membership era, has yet to take place as the legislation only made it to the committee stage in the House of Lords before the July general election.",
            "Since the Conservative and Labour parties spent the election criticizing each other, it might seem surprising that they have landed on the same page in terms of regulation and innovation. But then, ask a business if it likes regulation and you know what answer you'll get. Nobody likes regulations, but then nobody likes buildings falling down – or, more soberingly, catching fire.",
            "Governments tend to blame regulation for \"stifling growth and innovation\" because the real culprit is a much mightier foe: lack of investment. This week, UK-born researcher in psychology and computer science Geoffrey Hinton won the Nobel Prize in physics – jointly with John Hopfield, a US professor emeritus at Princeton University – for work on artificial neural networks.",
            "Hinton's career trajectory is suggestive of the malaise affecting UK innovation, which has little to do with regulation. His Wikipedia page states that though he gained a PhD at the University of Sussex, he left the UK after finding it difficult to get funding for his work. He has since spent the bulk of his career in the US and Canada.",
            "In a coincidence spotted by writer Ananyo Bhattacharya, not long before Hinton got his gong, the UK government confirmed it was withdrawing £6 million of grant funding to establish a new National Academy focused on mathematical sciences.",
            "Professor Jens Marklof, president of the London Mathematical Society, said the academy \"could have been a huge driver of economic growth by improving the flow of mathematical analysis, cutting-edge research, and technological innovation into policy making.\" He said the organization would engage with the government's other efforts to promote and support mathematics.",
            "In 2022, the Royal Society, British Academy, Royal Academy of Engineering, and Academy of Medical Sciences reported that UK investment in R&D was 1.74 percent of GDP, less than half the figure attributed to Korea (4.64 percent) and well below the OECD average of 2.48 percent. The previous government committed to match the OECD average by 2027, and in February pledged to spend £20 billion in the current fiscal year.",
            "In its RIO announcement, DSIT said £1.6 million would be awarded to the Food Standards Agency for its Engineering Biology Sandbox Fund, designed to \"test innovative regulatory approaches for products like cultivated meat.\" Fake meat aside, the government's autumn statement will tell us whether its ambitions in science and technology have real substance. ®"
        ],
        "publishing_date": "2024-10-09 10:31",
        "keywords": [
            "Government of the United Kingdom",
            "Research",
            "Science"
        ]
    },
    {
        "title": "Rivals weigh in on remedies for Vodafone-Three merger",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/vodafone_three_merger_remedies/",
        "body": [
            "Opinion is divided in the telecoms industry over the proposed Vodafone and Three UK merger, with at least one rival in favor of the deal, while others want to see the Brit competition regulator scrap it altogether.",
            "It has been over a year now since the two mobile providers announced their intention to combine their UK operations, claiming the move would create a third player in the British market with the scale to be able to compete against the two giants, BT/EE and Virgin Media O2 (VMO2).",
            "Since then, the Competition and Markets Authority (CMA) has taken an interest, and is working through its investigation into whether there are any potential antitrust issues over the pending union.",
            "Its provisional findings, published last month, expressed concern that it could lead to higher bills for customers and less choice for Mobile Virtual Network Operators (MVNOs) that rely on the companies with actual infrastructure to run their own services. The CMA also listed potential remedies it might enforce to address these concerns, including prohibiting the deal altogether.",
            "It will surprise few Reg readers that the UK's largest telco and former state-owned monopoly, BT, would rather not see two of its rivals joining forces, saying in its response to the CMA's Notice of Possible Remedies that: \"The CMA currently considers prohibition to be the only effective structural remedy. BT agrees.\"",
            "The telecoms giant notes that the CMA is seeking views on behavioral remedies as an alternative to an outright ban, but complains that these will be time-limited (such as freezing prices for two years) while any potential downsides such as reduced customer choice would be enduring.",
            "Accordingly, it says that \"BT does not believe behavioral remedies would work,\" and therefore \"prohibition is the only viable and proportionate remedy.\"",
            "But not everyone agrees. The UK's other major telco, VMO2, is rather more welcoming, saying: \"VMO2 considers that permitting the Merger, subject to the spectrum divestment and amended Beacon network sharing arrangements, will deliver the best outcome for UK consumers and businesses.\"",
            "The arrangements VMO2 is referring to here are a deal struck between it and Vodafone back in July to extend their current network sharing operations for more than a decade, as part of which some radio spectrum will also be transferred from the post-merger company to VMO2. Small wonder it favors the consolidation going ahead.",
            "\"The spectrum transfer will enable VMO2 to materially increase capacity, coverage, reduce congestion, and provide higher average upload and download speeds, thereby increasing competition in the retail and wholesale markets,\" the company states in its response.",
            "Unlike BT, it believes that any concerns the CMA might have can be addressed by behavioral commitments from the Parties. \"Behavioral remedies are appropriate in this case given the regulated nature of the telecoms sector,\" it says, claiming that Ofcom is well placed to assist the CMA in specifying, monitoring and enforcing VodaThree's proposed commitments.",
            "Looking beyond the two major players, MVNO Honest Mobile also comes out in favor of the merger, with CEO Andy Aitken saying: \"I believe that with the correct remedies, the merger will ultimately benefit the UK and consumers alike.\"",
            "Aitken's concerns naturally focus on the wholesale market remedies, telling the CMA that \"it is essential that virtual providers like Honest Mobile have continued access to these networks on fair and non-discriminatory terms,\" and calling for the merged entity to be required to maintain transparent pricing, preventing under-the-table practices that could disadvantage it and other MVNOs.",
            "Sky, owner of another MVNO, Sky Mobile, is dead against the move. It says: \"Sky considers that the Merger must be prohibited if the UK wants to retain a thriving and competitive mobile market for consumers with strong MVNOs able to compete head-on with Mobile Network Operators.\"",
            "The company claims that if approved, the deal will effectively set in stone the permanent, long-term structure of the UK mobile market since all spectrum licenses have already been allocated, preventing new market entrants.",
            "In a heavily redacted submission, Sky speaks out in very strong terms about the potential effects on MVNOs, saying: \"If the Merger proceeds without strong remedies, Sky would be forced into a future where the wholesale supply to MVNOs is even more concentrated and therefore much less competitive.\"",
            "It warns the CMA against generic \"sticking plaster\" remedies such as wholesale access terms and/or ring-fenced capacity. \"We do not consider that these remedies address the substantial competition concerns, will be effective or workable in practice,\" it states.",
            "The Unite Union also reaffirmed its opposition to the conjoining of Vodafone and Three, stating that one of its primary concerns is potential price increases for tens of millions of mobile customers, or else a reduced service such as smaller data allowances in contracts.",
            "It cited the Vodafone/TPG merger in Australia as evidence, which it says similarly reduced the market from four to three main players and resulted in all three significantly raising prices in the 12 months after the merger was completed in July 2020.",
            "Unite also claims that overall investment levels by Australian operators are now 45 percent lower than before that merger, and urges the CMA to protect UK consumers by blocking this one.",
            "Consumer group Which? appears to be neutral over the proposed deal, but expressed concerns that these might lead to higher prices for subscribers, and urges the CMA to ensure that if this does happen, the harm is offset by efficiencies and higher investment.",
            "\"We agree there is merit in exploring whether there is a package of behaviorial remedies which would credibly minimize the likely consumer harm from horizontal unilateral effects in the retail and wholesale markets, while maximizing the benefits from rivalry-enhancing efficiencies (REEs),\" the organization says.",
            "In summary, some valid objections to VodaThree's coupling are expressed, but self-interest plays a significant part in which remedy or remedies that respondents would like to see imposed. It seems that whatever final decision the CMA eventually comes out with, it is unlikely to please everyone. ®"
        ],
        "publishing_date": "2024-10-09 09:39",
        "keywords": [
            "Competition and Markets Authority",
            "Mobile Network",
            "Three UK"
        ]
    },
    {
        "title": "Thunderbird for Android finally reaches beta",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/thunderbird_for_android_beta/",
        "body": [
            "MZLA, the company behind the Thunderbird email client, is finally putting its mobile email client app into beta testing – but it's a lot more mature than that sounds.",
            "Thunderbird for Android has reached beta testing, and you can grab it from the Google Play Store. A version should follow on the FOSS F-Droid store soon. If you want to build it yourself, the source code is on GitHub.",
            "It has been a few years' wait: the Thunderbird Foundation hired the app's lead developer, Christian Ketterer, nearly two and a half years ago now. But saying that, although it's officially only a beta, the app is considerably more mature than it sounds.",
            "Not because he's had 28 months to work on the app. He has, but that's not the reason: the real reason is that Thunderbird for Android is not a ground-up new project. Thunderbird for Android is based on the existing K9 Mail application, which is 15 years old: it débuted late in October 2008. We installed the beta, and it describes itself as version 8.0b2.",
            "K9 Mail is a well-known and long established email client for Android – in fact, back in 2011 it was The Register Android App of the Week. It doesn't look that wildly different today from those 13-year-old screenshots.",
            "K9 Mail is also the basis of the email client supplied with several de-Googled Android phones. For instance, back around the same time as Thunderbird's acquisition, we also took a look at the /e/ Foundation Murena One. This de-Googled Android phone uses a fork of K9 Mail as its email client. So too does the privacy-centric Punkt MC02 that we looked at earlier this year.",
            "We installed the Thunderbird 8 beta on our Android 14 handset and it worked just as smoothly as K9 ever did. We added Hotmail and Yahoo accounts to it, and it automatically picked up the server config from its database, asked for our OAuth credentials, and that was it.",
            "This is the Android client of choice if you email like a pro. (And if you don't, you should learn.) It can handle proper grown-up style email messages in plain text, complete with bottom-posting. This is of course how the biggest FOSS project in the world is coordinated, on the LKML.",
            "Even those poor waifs weaned on Outlook, \"mentally mutilated beyond hope of regeneration\" as we feel Edsger Dijsktra would have put it, may find use for Thunderbird for Android. For instance, it can aggregate umpteen different email accounts into a single unified inbox. Different accounts are discreetly color-coded with a vertical bar in the subject line. ®"
        ],
        "publishing_date": "2024-10-09 08:31",
        "keywords": [
            "Email",
            "Mozilla Foundation",
            "Tablet"
        ]
    },
    {
        "title": "Copilot's crudeness has left Microsoft chasing Google, again",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/copilot_vs_notebooklm/",
        "body": [
            "Opinion A year ago it looked as if the world could be Microsoft's oyster. The software giant dominated the enterprise, was catching up to cloudy rivals, and then managed to purchase forty-nine percent of the for-profit subsidiary of ChatGPT creator OpenAI.",
            "Having secured a stake in the leading purveyor of generative AI, it started to build it into products that attracted enormous attention, like Bing. Microsoft dangled the enticing prospect that its long-suffering search services could improve to the point at which they would challenge arch-rival Google.",
            "It hasn't happened. And now it looks like it won't – that Google will deliver a more useful AI, faster.",
            "Microsoft's missteps started in May 2023 when it launched a company-wide strategy that could have been titled \"Copilot all the things!\" Windows 11 got a Copilot assistant and a Copilot key. Edge got a Copilot panel, while Microsoft 365 got the full treatment.",
            "It has become increasingly clear over the last few months, though, that those AI projects have been – to say the least – underwhelming. Enterprises of every shape and description are making decisions on whether to adopt pricey Microsoft 365 Copilot AI integrations into their office suites, and CFOs grill CIOs about ROI: Is it really worth doubling the monthly Microsoft tax?",
            "The answer has mostly been a shrug of the shoulders. Having Word or Outlook write for you, or PowerPoint create slideware on your behalf, is nice in theory. But few have adopted those features, or learned how to make them save the sort of time that would justify the investment.",
            "Though Copilot is touted as an ideal assistant to help with calculations, Excel users quickly learned that a language model trained on billions of words of English has no effective grasp of the very different paradigm of a spreadsheet. Yes, Copilot can compose a quick formula, but it can't operate within the context of a worksheet with anything like Word's facility to parse the meaning of a text document.",
            "To bridge this fundamental gap in capability, Microsoft Research recently published a paper on SpreadsheetLLM – a from-the-ground-up approach which looks as though it might yield an AI that can \"think\" in Excel. Or at least, maybe a few years from now. For now, the big improvement to Excel is Python, not AI.",
            "There is one shining star in the Microsoft 365 Copilot firmament: Teams. The one app everyone loves to hate – created to undercut Slack – Teams became an indispensable hybrid working tool during the pandemic. Copilot for Teams acts as the perfect secretary – taking transcripts of meetings, generating a summary, complete with action items. It even mails the participants.",
            "It's very helpful, but with a caveat: you might not want your every meeting recorded and transcribed. Anecdotally, a few of those transcripts have ended up as evidence in lawsuits.",
            "Thanks for that, AI.",
            "That gotcha points to the other reason Microsoft finds itself dead in the water in its efforts to drive Copilot into the enterprise: making it work well requires access to all of an enterprise's documents. That means effectively trusting your entire set of enterprise documents to OneDrive/SharePoint.",
            "Microsoft should know that’s not going to happen. Storage and analytics vendors spent the early 2000s suggesting their customers would go on metadata creation sprees to tame unstructured data and make it useful. That dream – and a dozen others aimed at organizing corporate data – died.",
            "To this day, very few enterprises have done the sort of deep data classification and sharing permissions necessary to create a safe-enough enterprise-wide environment for sharing sensitive documents. Nor have they trained their staff in how to work with data classification and data sharing with AI systems.",
            "By throwing Copilot at all the things, Microsoft tried to force enterprises into a future for which they found themselves wholly unprepared.",
            "While most enterprises would admit they need to adopt better data classification and sharing practices, few seem enthusiastic about making that investment a priority just to get a few extra features in Microsoft 365.",
            "They'll need a better justification – a killer app that clears away the logjam of legacy business practices and IT policies. Microsoft isn't offering that – nor, from the latest upgrades, does it look to be on the cards.",
            "But Google may have a killer app worth the effort: the NotebookLM, which looks to be the first RAG tool that can really help enterprises find the needles in the haystacks of their documents.",
            "NotebookLM is marvelously simple. Feed it documents and it will let you query them with prompts. Results are pleasing, and arrive swiftly. Ingestion tools could be better, but the results are strong enough to make it worth the effort.",
            "With NotebookLM Google has an opportunity to invent \"search for the age of AI\" Not some AI-poisoned version of Google Search, but a new tool, designed to make sense of enterprise data – not just help you make more of it.",
            "That's something that Microsoft could have offered but didn't, despite spending decades trying to make SharePoint the place you store everything.",
            "Remember also that Microsoft had to catch up and build decent search into Windows after 2004's Google Desktop, which searched local documents, made the OS look clunky.",
            "However, before we shed a tear for poor Microsoft, bear in mind that after its current sale of shares to investors, OpenAI carries a valuation of $157 billion. That makes Microsoft's stake worth nearly $80 billion. Even as Microsoft disappoints with AI, it has found a way to win. ®"
        ],
        "publishing_date": "2024-10-09 07:29",
        "keywords": [
            "AI",
            "Copilot",
            "Google"
        ]
    },
    {
        "title": "Missing Thunderbirds footage found in British garden shed",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/missing_thunderbirds_footage/",
        "body": [
            "Video Previously unseen footage from the classic British TV show Thunderbirds has been found in a garden shed and restored – where possible – for viewing next year.",
            "The family of a recently deceased former editor of the show found a collection of 22 rusty and cracked film cans in their Buckinghamshire shed. The film inside is currently being restored and digitized. They contain a lot of old material, but also some extended scenes and a previously-unseen new ending to one episode.",
            "Stephen La Rivière of Century 21 Films – who is leading the restoration drive – told the BBC recovering the footage “took weeks, bit by bit.\"",
            "\"Every night I'd get a link for a download of the latest one that had been scanned … you'd never know what you'd get. Eventually, listening one night … this one played out and it was not the same as broadcast.\"",
            "If you’ve never watched the show, the video below offers a good primer and a peek at the recovered footage.",
            "Youtube Video",
            "Thunderbirds was originally conceived as 30-minute episodes, but some were extended at the request of management. It's thought that the extra footage came from one of these extended episodes that never aired.",
            "Thunderbirds was the invention of British auteurs Gerry and Sylvia Anderson and was broadcast in 1965. It told the tales of International Rescue, a clandestine group set up by an American financier and his five sons to save human lives. The team had five aircraft, Thunderbirds 1 through 5, which roamed space, the surface and underwater realms of Earth doing the right thing – mostly.",
            "The series was filmed using a process they called “supermarionation” – wire controlled puppets that had basic electronics installed to move the characters' mouths in sync with the recorded script. It was a technique the duo used to great effect in other shows such as Captain Scarlet and the Mysterons, Fireball XL5, Sting Ray, and Joe 90 – and the team behind Team America: World Police appear to have been inspired by the technique.",
            "The show was screened again on British television in the 1990s and gained a new legion of fans. However, this success did not translate to the silver screen, with the 1960s films Thunderbirds Are Go and Thunderbird 6 flopping. The 2004 film Thunderbirds is best forgotten.",
            "It's hoped the new footage will be released next year as part of the celebrations of the show's 60th anniversary. Sadly it won't be seen by David Graham, who voiced four of the show's characters and then influenced a new generation as the voice of Grandpa Pig in the children's show Peppa Pig. Graham passed away last month at the age of 99. ®"
        ],
        "publishing_date": "2024-10-09 06:27",
        "keywords": [
            "Digital Transformation",
            "Television"
        ]
    },
    {
        "title": "Supermicro crams 18 GPUs into a 3U box",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/supermicro_sys_322gb_nr_18_gpu_server/",
        "body": [
            "GPU-enhanced servers can typically pack up to eight of the accelerators, but Supermicro has built a box that manages to fit 18 of them inside an air-cooled chassis that'll eat up just 3U of rack space.",
            "The delightfully named SYS-322GB-NR sports 20 PCIe slots, with the expectation that's where you'll connect GPUs. That's an unusual arrangement these days: most AI servers offer Nvidia's SXM socket or use the Open Accelerator Module spec, as both offer more inter-chip bandwidth than PCIe.",
            "But this box isn't designed to do the heavy lifting required of other AI servers. Supermicro suggests this machine for jobs like running machine learning and AI inference workloads at the edge, as part of automated production systems that require data to be processed from camera feeds or sensors at very low latencies. Another suggested role is using GPUs dedicated to graphics rather than AI and connecting up to 64 monitors – the sort of thing that gets visualization wonks excited at the prospect of building 46,080 x 12,960 pixel displays.",
            "At the back of the system is room for 18 single-slot GPUs or ten dual-slot cards. Or at least that's what the press release claims – the marketing imagery seems to indicate eight dual slot cards, though that may be less of a physical limit and more a power and cooling one.",
            "Supermicro doesn't say which cards it'll support – perhaps as we're between major releases from Nvidia and AMD – but does note that accelerators from both vendors are on the menu.",
            "For edge AI, we suspect Nvidia's diminutive L4 accelerators will be a popular configuration. Meanwhile, for those that need a little extra grunt, a bank of ten Nvidia L40S GUPs churning out 3.6 petaFLOPS of dense FP16 performance might be the ticket – assuming the PSU can supply roughly 5.5kW of power we estimate such a configuration would need under load.",
            "Supporting all those GPUs isn't trivial either. At the heart of the system are a pair of Intel 6900-series Xeons with support for up to 128 cores, 256 threads, and 96 lanes of PCIe 5 a piece, which feed 20 PCIe slots on the motherboard. The observant among you will note that even with 192 PCIe lanes, that's still not nearly enough for 18 – let alone 20 – PCIe x16 slots.",
            "It's not clear if Supermicro only supports eight lanes per slot when fully populated or if it's using a PCIe switch to overcome the limitation. If we had to guess, it's probably the former. Unless the GPUs need to shuffle data between one another, eight lanes per slot is probably fine. And if they do, Supermicro sells systems better suited to that use case. In any case, we've reached out for comment regarding power and PCIe bandwidth and will let you know what we find out.",
            "Beyond the sheer number of PCIe slots at your disposal, the system is otherwise a vanilla server that supports up to 6TB of DDR5 or, if you prefer something speedier, 8,800 MT/sec MRDIMMs. Storage is also pretty standard, with support for your choice of either 14 E1.S or 6 U.2 NVMe drives.",
            "Oh, and if GPUs aren't your thing but dense memory-packed servers are, Gigabyte recently announced a dual socket Epyc system with a whopping 48 DIMM slots. ®"
        ],
        "publishing_date": "2024-10-09 05:32",
        "keywords": [
            "AI",
            "Datacenter",
            "GPU"
        ]
    },
    {
        "title": "OpenAI appoints international expansion boss",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/openai_appoints_international_expansion_boss/",
        "body": [
            "Chat GPT-maker Open AI announced today that it's appointed a new boss to lead its international expansion.",
            "Oliver Jay – whose background includes building out Dropbox's sales team, a board appointment at Asia's Uber-analog Grab, and a stint as chief revenue officer at Asana – is taking on the role, leading OpenAI's strategy and operations in international markets.",
            "OpenAI also today announced Singapore will be home to its APAC office, serving as a hub for APAC operations. The firm already has a footprint in the region, after establishing its first Asian office in Tokyo earlier this year.",
            "The new office is expected to be opened by the end of the year – perhaps helped by a $6.4 billion infusion of cash at the start of this month.",
            "\"We really look forward to working with commercial partners, with government partners, as we grow our presence here, and really view this as a critical first step to our commitment to Singapore and to Asia more broadly,\" stated OpenAI's head of policy in APAC, Sandy Kunvatanagarn at Singapore's Tech Week conference following the announcement.",
            "Kunvatanagarn elaborated that part of the Singapore team's focus will be helping develop local language datasets through partnerships.",
            "\"I think we all realize that Asia is one of the most linguistically diverse places in the entire world,\" she asserted, stressing the importance of comfortable natural speech in OpenAI products. The head of policy said the data sets would be open to researchers and other developers.",
            "Kunvatanagarn noted that even though many are yet to become adept ChatGPT users, OpenAI has already signed millions of enterprise and commercial partners.",
            "The GPT-maker is banking on its o1 model, released a few weeks ago, to increase demand for its offerings. The o1 family of models uses \"chain of thought\" techniques that are supposed to produce more accurate output. Kunvatanagarn described it as a \"game changer\" during a Q&A session at the conference.",
            "She also frequently cited \"the science\" of AI, arguing it should be central to regulations, governance and the future of AI. Safety was another topic she addressed, by pointing out that OpenAI conducts rigorous evaluations of its wares.",
            "\"If people don't think that the models and the products are safe, they're not going to trust them, and if they're not going to trust them, then they won't be able to use them to their benefit,\" Kunvanatangarn reasoned.",
            "Priorities for the Singapore outpost will be to work with developers, governments, and commercial partners.",
            "Kunvanatagarn mused that when it comes to governments, many already \"have very good roadmaps on their own.\" ®"
        ],
        "publishing_date": "2024-10-09 04:58",
        "keywords": [
            "APAC",
            "Large Language Model",
            "OpenAI"
        ]
    },
    {
        "title": "MediaTek enters the 4th Dimensity with 9400 series silicon",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/mediatek_dimensity_9400/",
        "body": [
            "Fabless Taiwanese chip biz MediaTek has unveiled the fourth flagship entry in its Dimensity family of system-on-chips for smartphones and other mobile devices. It's sticking with close companion Arm rather than jumping ship to RISC-V for the CPU cores, for those wondering.",
            "The Dimensity 9400 processor – a rival to Qualcomm's Snapdragon series and Apple's own silicon – is continuing from the previous generation with an eight-core approach, with one Arm Cortex-X925 CPU core topping out at just over 3.6GHz, three Cortex-X4s rated up to 3.6GHz, and four Cortex-A720 cores running up to 3.3GHz. MediaTek dubbed this an \"all big core\" arrangement as opposed to the big-little core configuration seen in the Arm world.",
            "This is all fabbed on TSMC's 3nm process node, and sports 29.1 billion transistors, according to the designers. This node helps make the chip up to 40 percent more power efficient than the TSMC 4nm previous generation, the 9300, it's claimed.",
            "We're told the 9400 has double the L2 cache of the previous gen, and 50 percent more L3. Single-threaded performance has apparently been boosted by up to 35 percent in GeekBench 6.2 tests, and multicore by up to 28 percent. The 9400 is aimed at higher-end devices, and is hoped to follow in the footsteps of the 9300 and help grow MediaTek's sales.",
            "\"From a business perspective, last year, 2023, we did over a billion dollars of revenue in just the flagship segment,\" a MediaTek spokesperson told The Register. \"Our CEO and CFO have already said that we'll see over 50 percent growth year on year and are on track to take over $1.5 billion this year.\"",
            "It's not a product launch these days without AI being mentioned, and the 9400 is said to pack an eighth-generation machine-learning-accelerating neural processing unit (NPU), which MediaTek claims is as much as 80 percent faster at performing LLM prompt inference over the previous NPU, and is also as much as 35 percent more power efficient.",
            "Presumably that'll need software optimized for or targeting that hardware. Speaking of which, the latest SoC includes what's called a Dimensity Agentic AI Engine that, among other things, is supposed to provide a unified way of connecting applications to various models, neural network hardware acceleration, and generative services – whether that's all or partly local on the device or remote in the cloud. That may be useful for developers.",
            "On the graphics side, the 9400 carries a 12-core Arm Immortalis G925 GPU, with a claimed 41 percent boost in performance and 44 percent power savings potentially. Also on the power savings front, Mediatek has a 4nm Wi-Fi/Bluetooth combo chip that uses up to half the power of the previous generation to beam wireless data at up to 7.3Gbit/sec with an extra 30 meters (98 feet) of coverage – and the Bluetooth has a claimed range of 1.5 kilometers (almost a mile).",
            "Being a top-end design for MediaTek, the 9400 supports triple-screen devices like the one released earlier this year by Huawei. That Mate XT uses its own hardware rather than MediaTek's – if any other manufacturer wants to build the same, the 9400 SoC is an option.",
            "\"The MediaTek Dimensity 9400 will continue furthering our mission to be the enablers of AI, supporting powerful applications that anticipate users' needs and adapt to their preferences, while also fueling generative AI technology with on-device LoRA training and video generation,\" gushed MediaTek president Joe Chen in a canned statement.",
            "\"As the fourth-generation flagship chipset, the Dimensity 9400 continues to build on our momentum of steady growth in market share, and MediaTek's legacy of delivering flagship performance in the most efficient design for the best user experiences.\"",
            "MediaTek launched its silicon just ahead of Qualcomm, which is expected to announce the Snapdragon 8 Gen 4 SoC in the next few weeks. MediaTek reckons its 9400 will appear in phones shipping from the fourth quarter of 2024. ®"
        ],
        "publishing_date": "2024-10-09 04:31",
        "keywords": [
            "Mobile Phone",
            "Processors"
        ]
    },
    {
        "title": "Asian crime gangs are growing fast, thanks to AI",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/the_criminals_are_gaining_efficiencies/",
        "body": [
            "Organized crime syndicates across Asia are using AI, messaging platforms like Telegram, and cryptocurrency to help them expand, with help from dedicated service providers, according to a report the UN Office on Drugs and Crime (UNODC) published on Monday.",
            "\"Leveraging technological advances, criminal groups are producing larger scale and harder to detect fraud, money laundering, underground banking and online scams,\" explained Masood Karimipour, UNODC regional representative for Southeast Asia and the Pacific.",
            "He pointed out that this shift has led to the emergence of a \"criminal service economy,\" that has helped to make Asia a testing ground for transnational networks eager to expand their reach and diversify their operations. Unfortunately, these criminal enterprises are growing at a speed that's \"rapidly outpacing governments' capacity to contain it.\"",
            "Generative AI is a key contributor to the expansion of criminal activity, because it automates tricky tasks like money laundering, coding malware, or gathering breached data. Crims can now buy these services or tools to run them from underground markets, making it easier and cheaper to execute cyber attacks.",
            "The technology is also helping to improve attacks that employ social engineering, thanks to audio and video deepfakes, translation apps, and face-swapping software.",
            "The report revealed a staggering increase, over 1,500 percent, in deepfake-related crimes in the Asia Pacific from 2022 to 2023, along with a 600 percent rise in deepfake-related advertisements on platforms like Telegram between February and July 2024.",
            "\"Inflow of capital and expansion of markets has led to increasing professionalization among criminal operations and actors providing services to them,\" wrote the report's authors.",
            "Crime gangs and their service providers have therefore established solid physical and ICT infrastructure to back their online service-based business models. As their operations grow, they require a whole support system: mule bank accounts, cryptocurrency wallets, teams to manage those accounts, and marketplaces – to connect those needing funds moved with those who can facilitate it.",
            "Criminals have evolved from small, scattered gangs, into larger and well-organized groups – many operating in compounds staffed with people lured into forced labor.",
            "While many of these services are operating in clear violation of the law, others navigate a gray area, making it even harder to tackle the growing problem.",
            "The UNODC report described Telegram as a central and necessary conduit for these criminal networks. With sprawling channels and minimal moderation, this environment makes it easy for cyber criminals to operate with little fear of repercussions. The insistence by Telegram that the app is a simple tool and cannot be held responsible for the content or services provided on it leaves room for plausible deniability of illegal activities.",
            "However, according to the report, it's clearly evident that many active merchants are explicitly marketing to fraud operators with their wares and services and tailoring them to be more attractive to the criminals.",
            "Telegram has begun to see some consequences for enabling illegal activities. The CEO was arrested in France in August, and since then other governments have ordered material be removed from the app – including South Korea in September.",
            "How much this will change remains to be seen. Durov has promised to remove some features from the app that have been \"abused\" by criminals. In late September, he informed users that Telegram would disclose IP addresses and phone numbers of some terror suspects to the relevant authorities.",
            "Other important contributors to rising crime are underregulated online gambling platforms and often unauthorized virtual asset service providers (VASPs), both of which help to launder money.",
            "The report mentions that 43 percent of scam-related funds this year were funneled into digital wallets that just opened in 2024 – a significant jump from 29.9 percent in 2022. That surge of cryptocurrency use is attributed to the ease with which digi-dollars can be transacted across borders using techniques that law enforcement agencies can't easily track and which make it hard to recover stolen funds.",
            "Governments in the region are also grappling with the challenge of regulating over-the-counter (OTC) brokers that use decentralized networks to deal in financial instruments, and peer-to-peer (P2P) platforms. Though both types of org often operate legally, it's particularly common in Southeast Asia for them to be tied to illegal operations. One reason is that the region's OTC brokers are often held to lower know-your-customer requirements than the exchanges on which they operate.",
            "Stablecoins are particularly problematic. The study stated that as much as 70 percent of cryptocurrency related scam transactions globally in 2023 used stablecoins.",
            "Tether (USDT) on the TRON (TRX) blockchain is the money laundering option of choice, alleged the report. Nearly half of all illicit cryptocurrency transactions took place on the TRON blockchain, accounting for about 45 percent of the total illicit volume, a rise from 41 percent in 2022. Ethereum followed with 24 percent, while Bitcoin made up 18 percent. Among stablecoins, USDT transactions totaled at least $19.3 billion.",
            "One interesting trend caused by the use of stablecoins is a shortening of the number of days a scam was active. The shorter time a scam runs, the less chance stablecoin issuers have to blacklist its address.",
            "Average scam length dropped from 271 days in 2020 to 42 in the first half of 2024. The scammers pivoted away from elaborate Ponzi schemes with a wide net and towards shorter targeted campaigns – like pig butchering love scams or address poisoning. ®"
        ],
        "publishing_date": "2024-10-09 02:17",
        "keywords": [
            "AI",
            "APAC",
            "Asia"
        ]
    },
    {
        "title": "LinkedIn: If our AI gets it wrong, that's your problem",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/09/linkedin_ai_misinformation_agreement/",
        "body": [
            "Microsoft's LinkedIn will update its User Agreement next month with a warning that it may show users generative AI content that's inaccurate or misleading.",
            "LinkedIn thus takes after its parent, which recently revised its Service Agreement to make clear that its Assistive AI should not be relied upon.",
            "LinkedIn, however, has taken its denial of responsibility a step further: it will hold users responsible for sharing any policy-violating misinformation created by its own AI tools.",
            "The relevant passage, which takes effect on November 20, 2024, reads:",
            "In short, LinkedIn will provide features that can produce automated content, but that content may be inaccurate. Users are expected to review and correct false information before sharing said content, because LinkedIn won't be held responsible for any consequences.",
            "The platform's Professional Community Policies direct users to \"share information that is real and authentic\" – a standard to which LinkedIn is not holding its own tools.",
            "Asked to explain whether the intent of LinkedIn's policy is to hold users responsible for policy-violating content generated with the company's own generative AI tools, a spokesperson chose to address a different question: \"We believe that our members should have the ability to exercise control over their data, which is why we are making available an opt-out setting for training AI models used for content generation in the countries where we do this.",
            "\"We've always used some form of automation in LinkedIn products, and we've always been clear that users have the choice about how their data is used. The reality of where we're at today is a lot of people are looking for help to get that first draft of that resume, to help write the summary on their LinkedIn profile, to help craft messages to recruiters to get that next career opportunity. At the end of the day, people want that edge in their careers and what our GenAI services do is help give them that assist.\"",
            "The business-oriented social networking site announced the pending changes on September 18, 2024 – around the time the site also disclosed that it had begun harvesting user posts to use for training AI models without prior consent.",
            "The fact that LinkedIn began doing so by default – requiring users to opt-out of feeding the AI beast – didn't go over well with the UK's Information Commissioner's Office (ICO), which subsequently won a reprieve for those in the UK. A few days later, LinkedIn said it would not enable AI training on member data from the European Economic Area, Switzerland, and the UK until further notice.",
            "In the laissez-faire US, LinkedIn users have had to find the proper privacy control to opt-out.",
            "The consequences for violating LinkedIn's policies vary with the severity of the infraction. Punishment may involve limiting the visibility of content, labeling it, or removing it. Account suspensions are possible for repeat offenders and one-shot account removal is reserved for the most egregious stuff.",
            "LinkedIn has not specified which of its features might spawn suspect AI content. But prior promotions of its AI-enhanced services may provide some guidance. LinkedIn uses AI-generated messages in LinkedIn Recruiter to create personalized InMail messages based on candidate profiles. It also lets recruiters enhance job descriptions with AI. It provides users with AI writing help for their About and Headline sections. And it attempts to get people to contribute to \"Collaborative articles\" for free by presenting them with an AI-generated question.",
            "Salespeople also have access to LinkedIn's AI-assisted search and Account IQ, which help them to find sales prospects.",
            "Asked to comment on LinkedIn's disavowal of responsibility for its generative AI tools, Kit Walsh, senior staff attorney at the Electronic Frontier Foundation, said, \"It's good to see LinkedIn acknowledging that language models are prone to generating falsehoods and repeating misinformation. The fact that these language models are not reliable sources of truth should be front-and-center in the user experience so that people don't make the understandable mistake of relying on them.",
            "\"It's generally true that the people choosing to publish a specific statement are responsible for what it says, but you're not wrong to point out the tension between lofty claims of the power of language models versus language like this in user agreements protecting companies from the consequences of how unreliable the tools are when it comes to the truth.\" ®"
        ],
        "publishing_date": "2024-10-09 00:32",
        "keywords": [
            "AI",
            "Law",
            "LinkedIn"
        ]
    },
    {
        "title": "Microsoft issues 117 patches – two under active attack",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/patch_tuesday_october_2024/",
        "body": [
            "Patch Tuesday It's the second Tuesday of the month, which means Patch Tuesday, bringing with it fixes for numerous flaws, bugs and vulnerabilities in major software. And this one is a doozy.",
            "Microsoft has delivered 117 patches – two of which are for vulnerabilities under active exploitation – and plenty of others that are sufficiently serious that they deserve your rapid attention.",
            "The most serious flaw already being exploited by malfeasants is CVE-2024-43572 – a 7.8-rated problem with Microsoft's Management Console that would allow an unauthorized local attacker to run code on a machine using untrusted Microsoft Saved Console (MSC) files. Such files are essentially management utilities that can be accessed from the Microsoft Management Console. Running a bad MSC file could have nasty consequences.",
            "Microsoft rates this as a remote code execution flaw, with a caveat that an attacker would be remote and must somehow convince a victim to install the file locally.",
            "The flaw is present in Windows Server 2008 through 2022. Windows 10 and 11 are also at risk.",
            "The other exploited issue is CVE-2024-43573 – a CVSS 6.5 spoofing flaw in MSHTML that Microsoft describes as a moderate risk.",
            "Yes, you remembered right: MSHTML is the browser engine that powered Internet Explorer, which Microsoft snuffed several years back. But the code lives on inside Windows, and all versions of Windows Server after 2012 R2 are vulnerable. So are many releases of Windows 10.",
            "Three other patches have been issued for vulnerabilities that have already been published, although no exploitation code has been detected. There's a CVSS 8.8 in curl (CVE-2024-6197) that could be used to infect someone who connected to the wrong server, a CVSS 8.8 flaw (CVE-2024-43583) in Winlogon that would allow an unauthenticated attacker to get full System privileges, and a 7.1 fix (CVE-2024-20659) for Hyper-V that could defeat a machine's secure kernel if the user can be persuaded to reboot.",
            "Of the remainder, the two most serious patches by CVSS score are a 9.8 remote code execution vulnerability (CVE-2024-43468) in Microsoft Configuration Manager that would allow remote code execution via SQL and a 9.0 elevation of privilege flaw in Netlogon (CVE-2024-38124) that would let an unauthenticated attacker get full admin credentials with no user interaction required.",
            "Adobe brought 52 CVEs to October's patch party – none of them under exploitation and all low priority.",
            "The graphics and publishing mainstay issued patches for its Commerce and Magento, FrameMaker, InDesign, InCopy, Dimension, Animate, Lightroom, and 3D Painter, and Substance 3D Stager packages.",
            "SAP reported a dozen issues – six of which are patches for previous patches.",
            "The worst of the re-patches covers CVE-2024-41730, a 9.8-rated BusinessObjects bug the ERP giant tried to patch back in August but which needs another fix.",
            "The worst of the new flaws is CVE-2022-23302, a CVSS 8.0 problem with JMSSink in Apache Log4j 1.x that impacts users of SAP Enterprise Project Connection. Users have also been warned of fresh fixes for BusinessObjects Business Intelligence Platform, Commerce Backoffice, NetWeaver Enterprise Portal, and HANA. ®"
        ],
        "publishing_date": "2024-10-08 23:30",
        "keywords": [
            "Adobe",
            "Microsoft",
            "Patch"
        ]
    },
    {
        "title": "AI pioneers Geoffrey Hinton, John Hopfield win Nobel Prize",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/ai_godfather_wins_nobel_prize/",
        "body": [
            "If you needed another sign that we've well and truly entered the AI age, here it is: The first Nobel Prize has been awarded for contributions to artificial intelligence.",
            "AI \"godfather\" Dr. Geoffrey Hinton, and his intellectual predecessor in the realm of learning machines, Dr. John Hopfield, were jointly awarded the 2024 Nobel Prize for physics today \"for foundational discoveries and inventions that enable machine learning with artificial neural networks,\" the Royal Swedish Academy of Sciences said.",
            "El Reg readers and AI watchers are likely familiar with Hinton's pioneering work on neural networks, and his high-profile departure from an advisory role at Google, driven by concerns over the potential dangers of the AI systems he helped create. Hopfield's work, on the other hand, is even more foundational to modern AI, and influenced Hinton's advancements.",
            "According to a write up [PDF] of the reasons for the award, Hopfield's greatest contribution to AI came in 1982 when he created a neural network (named after himself) capable of storing multiple patterns and retrieving them from memory by distinguishing between them.",
            "The Committee likened the \"Hopfield network\" to the brain's associative memory, where we search for and recall information, such as words. It described the network as a system of artificial neurons with varying connection strengths.",
            "\"Hopfield described the overall state of the network with a property that is equivalent to the energy in the spin system found in physics; the energy is calculated using a formula that uses all the values of the nodes and all the strengths of the connections between them,\" it explained.",
            "By the time the entire network processes the data, it often reproduces the original image it was trained on, the Academy noted, but what made it truly special was its ability to store multiple pictures at the same time, and differentiate between them.",
            "From recall to interpretation",
            "While a Hopfield network and associative memory techniques can recall images as patterns in data, it can't interpret what they are. That's where Hinton came in.",
            "\"When Hopfield published his article on associative memory, Geoffrey Hinton was working at Carnegie Mellon University in Pittsburgh, USA,\" the Academy said. \"Along with his colleague, Terrence Sejnowski, Hinton started from the Hopfield network and expanded it to build something new, using ideas from statistical physics.\"",
            "\"The states in which the individual components can jointly exist can be analyzed using statistical physics, and the probability of them occurring calculated,\" the Nobel awarding body said. Measure those probabilities and assign them to objects, and you have Hinton's Boltzmann machine.",
            "Another neural network, but a far more advanced one, the Boltzmann machine can learn from examples of data, recognize familiar traits across samples, and recognize new examples of an object by filtering known basics into various categories.",
            "Boltzmann machines are still used today to power recommendation engines and other basic AIs, and are frequently a part of larger machine learning networks.",
            "\"The laureates' work has already been of the greatest benefit. In physics we use artificial neural networks in a vast range of areas, such as developing new materials with specific properties,\" Ellen Moons, Chair of the Nobel Committee for the physics prize said.",
            "From interpretation to worry",
            "It's the second major award Hinton's won for his contributions to AI, after sharing the 2019 Turing Prize - often called the Nobel of computing - with fellow \"AI godfathers\" Yoshua Bengio and Yann LeCun.",
            "Since then, however, Hinton has become downright skeptical of the learning machines he helped create. After leaving Google in May 2023, Hinton expressed regret for his role in laying the foundation for modern AI, saying that when he looked at AI's growth to date and how it was likely to impact society in the future, the possibilities were \"scary.\"",
            "\"I console myself with the normal excuse: if I hadn't done it, somebody else would have,\" Hinton told the New York Times' Cade Metz, a former Register journalist, last year.",
            "Hinton was joined by Bengio in signing an open letter last year calling for regulation of AI to prevent future harms. The letter likened AI to the threat of climate change, saying that while we ignored those warnings, we could head off trouble with AI before it's too late.",
            "\"There is a responsible path, if we have the wisdom to take it,\" the letter begs. Hinton reiterated his concerns about AI in an interview shortly after he found out he won the Nobel.",
            "\"I wish I had a sort of simple recipe that if you do this, everything's going to be okay. But I don't,\" Hinton told Nobel Prize Outreach's chief science officer Adam Smith. \"We're a kind of bifurcation point in history where in the next few years we need to figure out if there's a way to deal with that threat [of AI running amok].\"",
            "\"One thing governments can do is force the big companies to spend a lot more of their resources on safety research,\" Hinton added. \"Companies like OpenAI can't just put safety research on the back burner.\"",
            "Hinton and Hopfield will share a prize of 11 million Swedish kronor (about $1 million), and will receive their awards on December 10, the anniversary of dynamite inventor and prize namesake Alfred Nobel's death in 1896. ®"
        ],
        "publishing_date": "2024-10-08 22:30",
        "keywords": [
            "AI",
            "Machine Learning",
            "Neural Network"
        ]
    },
    {
        "title": "Qualcomm urges OEMs to patch after 'targeted' exploitation",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/qualcomm_patch_spyware/",
        "body": [
            "Qualcomm has issued 20 patches for its chipsets' firmware, including one Digital Signal Processor (DSP) software flaw that has been exploited in the wild.",
            "That vulnerability, CVE-2024-43047, carries a CVSS 7.8-out-of-10 severity rating, and was notably reported by both Google's Project Zero team and Amnesty International's code testers. The involvement of the latter indicates this bug has been exploited by either nation-state attackers or commercial surveillanceware vendors, or both.",
            "\"There are indications from Google Threat Analysis Group that CVE-2024-43047 may be under limited, targeted exploitation,\" Qualcomm said in its advisory for the updates. \"Patches for the issue affecting the FASTRPC driver have been made available to OEMs together with a strong recommendation to deploy the update on affected devices as soon as possible.\"",
            "Ie, those device makers need to push these fixes out to people's gadgets ASAP. Look out for updates to install and apply them.",
            "So far, the CVE-2024-43047 flaw affects Snapdragon 660 and newer models, Qualcomm's 5G modems, and FastConnect 6700, 6800, 6900, and 7800 Wi-Fi/Bluetooth kit.",
            "Of the other 19 flaws, there's CVE-2024-33066, a critical improper input validation issue with the WLAN resource manager which has a CVSS score of 9.8. Luckily so far, to our knowledge, this hasn't been exploited yet.",
            "Qualcomm also warned of two other high-severity vulnerabilities - CVE-2024-23369 and CVE-2024-33065. The latter, rated CVSS 8.4, involves memory corruption in the camera driver. Meanwhile, the former is a similar memory flaw, affecting the device's high-level operating system. The chipmaker also released two other patches for medium-severity bugs.",
            "The remaining 14 patches comprise nine high-severity and five medium bugs. Seven cover WLAN operations, three fix issues in the DSP service, and there's a grab-bag of other code improvements - although some of them were noted around a year ago and are only now being fixed.",
            "Qualcomm got its announcement out early today, and we're still waiting to see what Patch Tuesday will bring from Microsoft and others. ®"
        ],
        "publishing_date": "2024-10-08 21:30",
        "keywords": [
            "Patch",
            "Qualcomm",
            "Spyware"
        ]
    },
    {
        "title": "Celebrating Babbage boffin Ada Lovelace",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/ada_lovelace_day/",
        "body": [
            "Today we remember Ada Lovelace Day, famed for her work on Charles Babbage's proposed mechanical computer, the Analytical Engine.",
            "In 1843, Lovelace published what would now be recognized as a computer program to generate Bernoulli numbers and was the first to see the creative potential of Babbage's machine.",
            "While there is some debate regarding Lovelace's status as the world's first computer programmer, her contribution is undeniable.",
            "Lovelace's name was also adopted for the Ada programming language, which first appeared in 1980, with inspiration drawn from the likes of Pascal. While niche compared to popular modern languages, Ada has seen use as a teaching language and is often used in high-integrity and safety-critical domains, such as military-grade avionics and air traffic control systems.",
            "As for the day honoring Lovelace, its goal is to increase the profile of women in STEM and encourage more girls into STEM careers. It has its work cut out. Despite improvements since the event's founding, inequalities and disparities in the IT world remain.",
            "That said, things have improved over the years. There are more women in technology despite the antics of the \"tech bros\" who tend to conveniently forget the female pioneers upon whose work they are building.",
            "Lovelace was born on 10 December 1815, the daughter of a mother who also enjoyed her math – Anne Isabella Noel, dubbed by husband Lord Byron as the \"Princess of Parallelograms.\" Raised away from her father, Lovelace was tutored in mathematics potentially because of her mother's interest in it, but also purportedly to provide her with a \"discipline\" that would prevent her suffering the mental illness that afflicted Byron.",
            "She excelled at math, with Babbage describing her as \"The Enchantress of Numbers.\" Lovelace's potential was probably never fully realized – she died in 1852 at age 36.",
            "Inspired by the Difference Engine when she first saw it in 1833, Lovelace subsequently worked with Babbage on the Analytical Engine, translating Italian engineer Luigi Menabrea's analysis of the machine, adding her own notes and observations.",
            "Her Analytical Engine algorithm – to calculate Bernoulli numbers – has been described as the world's first computer program, although it was never tested in practice. ®"
        ],
        "publishing_date": "2024-10-08 20:30",
        "keywords": [
            "Career",
            "Information Technology",
            "Retro computing"
        ]
    },
    {
        "title": "TensorWave bags $43M to add 'thousands' AMD accelerators",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/tensorwave_amd_gpu_cloud/",
        "body": [
            "TensorWave on Tuesday secured $43 million in fresh funding to cram its datacenter full of AMD's Instinct accelerators and bring a new inference platform to market.",
            "Founded in late 2023, the Las Vegas-based startup is one of several cloud providers that have popped up amid the generative AI boom, looking to replicate the successes of CoreWeave and Lambda. But rather than stick with Nvidia accelerators, TensorWave's founders are betting it all on AMD's HBM-packed Instinct accelerators.",
            "TensorWave began racking up MI300X-based systems this spring. The startup now aims to add \"thousands\" more of the accelerators and scale up its team to support the launch of a new inference platform called Manifest in the fourth quarter.",
            "AMD's MI300X has seen widespread adoption across multiple cloud providers since its launch last December. In addition to TensorWave, Microsoft is now running OpenAI's GPT-4 Turbo and many of its Copilot services on the chips, and Oracle has also deployed a cluster of 16,384 MI300X accelerators. As a result, AMD now expects Instinct accelerators to drive $4.5 billion in revenues in 2024.",
            "Even cloud upstart Vultr now plans to offer MI300X based instances.",
            "On paper, there's a lot to like about the chips, which not only offer substantially higher floating point performance but more than twice the memory than Nvidia's coveted H100 at 192 GB compared to 80 GB.",
            "Memory capacity is particularly valuable for those running larger models at full 16-bit precision. With 1,536 GB per node, an MI300X-based system can easily fit Meta's Llama 3.1 405B at full resolution, whereas it would need to be split between multiple H100 systems or compressed using 8-bit quantization to fit. While it is possible to squeeze the uncompressed model into a single H200 node, doing so doesn't leave a ton of room left over for the larger context window supported by the model.",
            "With the launch of its next-gen MI325X accelerators later this year, AMD will further extend this lead, pushing the accelerator to 288 GB of capacity, more than three times that of the H100 and 50 percent more than Nvidia's upcoming Blackwell parts.",
            "TensorWave intends to start deploying the chips in its datacenter as soon as they hit the market, potentially before the end of the year.",
            "Alongside new hardware, the startup is preparing to launch an inference service in the fourth quarter, which will give customers an alternative to renting entire systems and managing their own software stack.",
            "TensorWave hasn't said much about the service just yet, but an emphasis on large context windows and lower latency suggests they may be leaning on the MI300X's memory capacity and bandwidth to support retrieval augmented generation (RAG) use cases. We've previously explored RAG in detail, but in a nutshell it functions as an external database from which large language models can retrieve data.",
            "TensorWave is far from the first company to launch a managed inference service. SambaNova, Cerebras, Groq, not to mention many of the model builders, have launched similar offerings, which bill by the token rather than GPU hours.",
            "But while $43 million isn't chump change, it's still tiny compared to the hundreds of millions and even billions in funding Lambda and CoreWeave and others have managed to talk their VC backers into.",
            "When we last spoke to TensorWave's founders in April, the startup aimed to have 20,000 some Instinct accelerators operational by the end of 2024. But as we understand it, those plans were dependent in part on debt financing.",
            "In a statement to El Reg, TensorWave couldn’t provide specifics on the progress of its datacenter build out.",
            "“While we can’t share specific numbers at this stage, I can confirm that we’re making significant progress toward our goal of deploying GPUs across our data centers,” CEO Darrick Horton told us.",
            "\"Our partnership with AMD and access to their Instinct MI300X and upcoming MI325X accelerators have positioned us to meet the growing demand for AI compute resources. We’re well on track and excited about the milestones we expect to hit as we close out the year.\" ®"
        ],
        "publishing_date": "2024-10-08 19:23",
        "keywords": [
            "AI",
            "AMD",
            "Datacenter"
        ]
    },
    {
        "title": "Don’t use iPhone Mirroring at work, experts warn",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/iphone_mirroring_at_work/",
        "body": [
            "If you're using iPhone Mirroring at work: It's time to stop, lest you give your employer's IT department the capability to snoop through the list of apps you have on your phone — dating apps, those tracking medical conditions or sexual history, or any other NSFW apps that you might want to keep to yourself.",
            "iPhone Mirroring is a feature that allows users to wirelessly use iPhones for viewing content on the device, using apps, and receiving notifications on a Mac. It requires macOS 15 Sequoia, iOS 18, and Apple Silicon to work.",
            "It's great for home use, but presents a potential privacy risk between employers and employees using a work-issued Mac computer.",
            "\"For iPhone users, this Apple bug is a major privacy risk because it can expose aspects of their personal lives that they don't want to share or that could put them at risk,\" according to Sevco Security, which spotted the oversight and reported it to Apple.",
            "This includes potentially exposing the use of a VPN app in a country that restricts internet access, a dating app that indicates the user's sexual orientation in a region where that's not safe or has legal consequences, or a health app that inadvertently shares a medical condition or pregnancy that the employee doesn't want their work to know about.",
            "Plus, for organizations, \"this bug represents a new data liability from potentially collecting private employee data\" that could lead to privacy law violations, lawsuits, and government agency enforcement actions, the researchers note.",
            "According to Sevco, executing mdfind in a terminal window that has been granted full disk access exposes a list of personal iOS apps and metadata if the iPhone user has turned on iPhone Mirroring. The bug does not, however, reveal the contents of a user's apps.",
            "Here's the command line interface the researchers used to reproduce this flaw:",
            "Apple, we're told, has identified the cause and is working on a fix. The Register reached out to the iThings giant for comment and a timeline but did not receive an immediate response.",
            "Sevco says it has alerted \"several enterprise software vendors\" that share customers with the security shop and Apple, and has also notified its own customers that have collected or could potentially collect private employee data - and then suffer the consequences.",
            "But to be blunt, companies should also alert employees about the issue, advise them not to use this feature at work, and also work with any third-party enterprise IT vendors that collect software inventory from Macs until Apple issues a patch. ®",
            "Editor's note: This article was updated to clarify that this oversight reveals the list of applications on a device, though not the contents. We're happy to make that clear."
        ],
        "publishing_date": "2024-10-08 18:30",
        "keywords": [
            "Apple",
            "Privacy",
            "Security"
        ]
    },
    {
        "title": "Generative AI trained on congressman statements for debate",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/congressman_ai_bot/",
        "body": [
            "Generative AI has reached its logical conclusion with a chatbot ready to stand in for a congressional incumbent at a debate.",
            "Dubbed \"DonBot,\" the chatbot is the brainchild of Bentley Hensel, a software engineer running for US Congress as an independent candidate. Bentley aims to \"bring technological innovation and transparency to the federal government,\" but the Democratic incumbent, Don Beyer, is apparently not interested in appearing in further debates.",
            "Hensel's solution, rather than the traditional empty chair approach, where candidates would pretend to debate the absent incumbent, is to train a generative AI on Beyer's press releases, website, and so on. The chatbot, a text-based AI running on an OpenAI API, would therefore have an \"understanding\" of what Beyer might say in a debate.",
            "Hensel is all about transparency and technical innovation – hence the publicizing of DonBot. Despite transparency not being the first word that springs to mind when considering OpenAI, the code behind DonBot (or CandidateGPT) can be looked at on GitHub and is open source under the AGPL-3.0 license.",
            "A spokesperson for the Hensel for Congress campaign told The Register that the chatbot was \"designed to provide straightforward, factual responses based solely on publicly available data from Beyer's official sources.\"",
            "Not at all like a real politician, judging by some recent performances.",
            "The spokesperson continued: \"While leveraging OpenAI's API as the underlying technology, Bentley has taken measures to minimize AI 'hallucinations' by grounding responses strictly in the dataset derived from Beyer's materials.\"",
            "The system runs locally on Dell r730s in Bentley's home lab, uses a PostgreSQL database for a back end, and is written in Python, \"though due for a refactor.\"",
            "We were given access to the chatbot and, in our admittedly unscientific experimentation, found it gave very clear and factual information on Beyer's policies without resorting to made-up facts and statistics. It also gave us a lengthy spiel on DonBot's appreciation for cheese and local cheese producers when we asked: \"Do you like cheese?\"",
            "Using the no inference option resulted in a terse \"The provided information does not mention my personal preferences regarding cheese.\"",
            "The spokesperson said: \"If Beyer, or any other candidate, does not attend the debate, they will be given an opportunity to review and revise any content used to generate DonBot's responses.\"",
            "Hensel told The Register: \"There's a lot I still want to improve, but time is definitely limited. If all the stars align, I hope to roll out a candidate comparison feature where users can ask questions, and all the AI candidates in the race will respond.",
            "\"That's still dependent on bandwidth, but once it's done, I'd love to spin up a version for Harris vs. Trump as well.\"",
            "Concerns over the use of AI technologies anywhere from social media to political discourse have reached fever pitch. Earlier this year, a political consultant was fined $6 million for bogus robocalls that used AI-generated voice cloning technology to impersonate US President Joe Biden. In April, Microsoft warned that the results of elections might be influenced by malicious actors armed with AI tools. However, Clint Watts, general manager of Microsoft's Threat Analysis Center, added that the deception and misinformation might not be as sophisticated as feared.",
            "Beyer did not immediately respond to The Register's questions, but even the possibility of replacing a politician with an AI does seem to hint that the rise of the machines might occur sooner than expected. Unless, of course, a hallucination results in Congress calling for sanctions on cheese rather than a foreign power. ®"
        ],
        "publishing_date": "2024-10-08 18:15",
        "keywords": [
            "AI",
            "ChatGPT",
            "OpenAI"
        ]
    },
    {
        "title": "Free Starlink for Hurricane Helene victims not entirely free",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/free_starlink_hurricane_helene/",
        "body": [
            "Updated The free Starlink service Elon Musk and SpaceX so graciously promised for communities devastated by Hurricane Helene in the US is not actually entirely free, according to those living in the aftermath - and the internet satellite operator's own signup page.",
            "There is a significant caveat: You are still expected to foot the bill for the hardware.",
            "Starlink's Twitter account declared last week, in a post with tens of millions of views, that \"Starlink is now free for 30 days.\" The world's richest man, with a net worth of approximately $260 billion, followed up by saying, in quite the PR coup, that all Starlink terminals would now work automatically \"without [the] need for payment in the areas affected by Hurricane Helene.\"",
            "But try to sign up for the ostensibly \"free\" service in an area Starlink has designated as a Helene disaster zone, and surprise: You still have to pay for the terminal (normally $350, but reportedly discounted to $299 for disaster relief, though that's not reflected in Starlink's signup page), plus shipping and tax, bringing the grand total to just shy of $400.",
            "You can see for yourself in the video below; putting in the address of city hall in Boone, North Carolina, one of the areas wrecked by the lethal super storm, shows folks recovering from the disaster are still expected to pay hundreds for that that free, month-long Starlink service. Though better than nothing at all, it is not quite the humanitarian aid it was promoted and heralded as.",
            "Youtube Video",
            "Read further into the details on Starlink's help page for Hurricane Helene, and one might think it's a ploy to bag new customers in far-flung places.",
            "According to the Starlink Helene page, new customers who qualify for free access will be automatically moved to a paid $120-a-month residential subscription tied to the location the terminal was set up for after 30 days.",
            "Existing customers who already have a dish and want to have their fees waived as a result of the disaster, meanwhile, have to create a support ticket that Starlink will evaluate for a waiver later. Not quite as clear cut as Musk's promise that all terminals in affected areas will get service \"without the need for payment.\"",
            "In the words of Boone resident Kinney Baughman, the offer appears more \"a crafty, bait and switch ... meant to take advantage of people instead of helping them.\"",
            "The Register interviewed Baughman – a philosophy professor and IT pro, whose power had just been restored in the wake of Helene – about what he's seen on the ground from SpaceX's Starlink. Spoiler alert: He's not impressed.",
            "Baughman told us that after Musk made the free service offer, the North Carolinian started getting calls from friends asking whether it was worth signing up, and he said, yes, it is – in limited cases.",
            "\"There may be isolated scenarios when what [Musk] is offering will be a service,\" Baughman said. \"But we're talking about cases where someone's way up a holler, doesn't have access to cell service, and where the flooding has broken their fiber. You're looking at months before you get service. In that case you might want to think about [Starlink].\"",
            "But that's an isolated case, Baughman noted. By the time Starlink arrives for others, general internet service may already be working, and thus someone is roped into paying for a satellite service they don't actually need.",
            "\"If UPS can drive a truck to your house [to deliver the Starlink receiver], you're not in that bad of shape,\" Baughman told us, so if you can get that terminal, you might not really need it by the time it gets there in Starlink's 2-3 week delivery window.",
            "And that's not even including the need to power the thing.",
            "\"Assuming someone can get over the one or two, if not more, bridges that are down and physically get their hands on the device, you still need electricity to run the thing,\" Baughman noted. \"Thousands of people are out of power still and hundreds if not thousands of those don't have a generator.\"",
            "\"He's pitching it to a broad audience that, hey, I'll give you free internet,\" Baughman concluded of Musk's offer. But it's not free at all, he said, making it nothing but \"a play on the desperation\" of North Carolinians still trying to recover, and a PR drive over little.",
            "\"When someone comes along and says I'm going to give you free internet, people start going nuts,\" Baughman said. \"Starlink is pulling on the heart strings of people overwhelmed by disaster.\"",
            "It's also tricky to sign up for a broadband internet service with no internet. And if you can get enough cellular signal to sign up now, you might wonder why you would wait weeks to be pulled into a paid-for satellite service.",
            "Register editor Nicole Hemsoth Prickett took the \"free\" service for a spin on a wrecked, closed section of the Blue Ridge Parkway deep in Helene damage territory, clicked on the $0 offer, and ended up with a cart totaling nearly $400.",
            "\"Like everyone else using what little phone battery was left, I navigated with SOS bars and no connectivity to starlink.com/activate only to see that it wasn't actually free,\" she said. \"I could connect to an active webpage in the middle of nowhere, which really says hey, data connectivity could actually be working again, but not for you with Starlink unless you pony up. It was insult to injury for many here who thought Free Internet Space Magic was real.\"",
            "Musk said Starlink terminals were being deployed in public buildings, such as city halls, fire departments, and the like, and there's evidence terminals have been deployed in those locations.",
            "That said, \"there are a lot of people who still can't get [to those places],\" Baughman told us.",
            "Musk seemed to acknowledge the shortcomings in his earlier plan to ship Starlink terminals directly to some locations, telling conservative pundit Tucker Carlson that, when Starlink first wanted to distribute dishes in North Carolina, it wasn't allowed to land any of its helicopters to deliver the hardware because of temporary rules in place requiring any aircraft landing in the disaster area to know who it was meeting with.",
            "\"It's obviously impossible for people without internet communications to let us know who they are because they don't have the internet,\" Musk said, while giving credit to US transportation secretary Pete Buttigieg for fixing the situation, and presumably allowing Musk's helicopters in, after a phone conversation.",
            "\"No one is shutting down the airspace and FAA doesn't block legitimate rescue and recovery flights,\" Buttigieg said on X. \"If you're encountering a problem give me a call.\"",
            "The White House has described its efforts to help those affected by the hurricane here.",
            "Interestingly enough, as Baughman pointed out, the Helene Starlink offer seems pretty close to the 30-day trial the SpaceX subsidiary offers new residential customers. But there are differences. That 30-day trial offer allows users to return the hardware for a full refund after that period. The $120 service charge for the trial is not returned. The marketing around that has led some to believe, wrongly, it's 30 days of free service with the option to back out entirely, fully refunded, if unhappy with the connectivity.",
            "The Helene offer, meanwhile, is 30 days of free service, provided one already has a dish or is willing to buy it knowing they'll be moved to a paid-for plan straight after.",
            "\"[Musk is] just building a customer base,\" Baughman concluded.",
            "We note SpaceX is also working with the FCC to get its direct-to-cellular satellite service available to those in North Carolina, though it's not yet known whether the service will be practically usable for anything beyond getting emergency push alerts.",
            "\"The satellites have already been enabled and started broadcasting emergency alerts to cellphones on all networks in North Carolina,\" SpaceX said on X. \"In addition, we may test basic texting (SMS) capabilities for most cell phones on the T-Mobile network in North Carolina.\"",
            "However, \"SpaceX's direct-to-cell constellation has not been fully deployed, so all services will be delivered on a best-effort basis,\" the aerospace giant added.",
            "We've reached out to SpaceX and Musk to get their sides of the story, and we haven't heard back from either despite numerous emails.",
            "\"If [Musk] was really interested in helping us up here he'd be giving the devices, letting folks use them for 30 days, collecting them, and sending them to Florida,\" Baughman said, referring to Hurricane Milton, currently gathering its strength in the Gulf of Mexico and predicted to be one of the most devastating storms to ever hit the state of Florida.",
            "Floridians, take notice: Beware geeks bearing gifts in the coming days. ®",
            "It appears since we published this article, the Starlink help page for Helene communities has been updated with the following caveat:",
            "Yesterday, that notice was not on that page, as captured by the Internet Archive. We've also clarified in our coverage the terms of the residential trial offer. We're happy to help."
        ],
        "publishing_date": "2024-10-08 17:07",
        "keywords": [
            "Elon Musk",
            "SpaceX",
            "Starlink"
        ]
    },
    {
        "title": "Foxconn, Nvidia to deploy Taiwan's fastest AI supercomputer",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/foxconn_nvidia_ai_supercomputer/",
        "body": [
            "Nvidia has confirmed it will be working with mega electronics contractor Foxconn to construct Taiwan's most powerful AI supercomputer.",
            "The project, centered on the Hon Hai Kaohsiung Supercomputing Center, will be underpinned by Nvidia's Blackwell architecture to deliver over 90 exaFLOPS of \"AI computing power\" which these days is code for \"ever-lower precision\". In this case, FP4.",
            "The system is expected to support a range of AI-driven applications across industries such as smart manufacturing, healthcare, robotics, and autonomous driving. For Foxconn, this move signifies its growing ambitions in high-performance computing (HPC), particularly in smart vehicles and electric vehicles (EVs) as it increasingly integrates AI into its business operations.",
            "The system will host over 2,000 GB200 NVL graphics cards designed for advanced AI model training. As expected, the Nvidia-driven architecture will support up to 130 TBps of bandwidth for comms and is expected to incorporate Nvidia's DGX Cloud Infrastructure and Spectrum-X networking frameworks to support scalable AI model training.",
            "Foxconn, the world's largest contract electronics manufacturer and iPhone supplier, has been diversifying into semiconductor packaging and EVs, among other sectors, and with the collab announced today will be hoping to reinforce Taiwan's growing importance in the global AI and HPC sectors. Industries ranging from robotics to medical research are poised to benefit from the new supercomputing resources, positioning Taiwan as an important player in the future of large-scale AI development, the company says.",
            "\"Powered by Nvidia's Blackwell platform, Foxconn's new AI supercomputer is one of the most powerful in the world, representing a significant leap forward in AI computing and efficiency,\" said Foxconn VP James Wu.",
            "The partnership reflects broader industry trends, with more manufacturers seeking to dominate in AI and HPC. Taiwan, already a leader in these areas, is cementing its role as a global hub for advanced computing. The Hon Hai Kaohsiung Center is slated to begin deployment in 2025, with full operations expected by 2026. ®"
        ],
        "publishing_date": "2024-10-08 15:57",
        "keywords": [
            "AI",
            "Foxconn",
            "HPC"
        ]
    },
    {
        "title": "DoE HALEU supply contracts solve step 2, ignore step 1",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/does_awards_nextgen_nuclear_fuel/",
        "body": [
            "The US Department of Energy has awarded shares of an $800 million contract for advanced nuclear fuel deconversion to four companies, but it's unclear who will be in charge of getting refined fuel to those deconversion sites.",
            "High-assay low-enriched uranium, or HALEU, is needed for nuclear reactor designs like small modular reactors (SMRs), molten salt reactors and other new variations that are supposed to be safer and more efficient. Unlike traditional nuclear fuel, which contains up to 5 percent uranium-235 (the isotope that's used to power nuclear power plants), HALEU includes a large proportion of the fissile isotope (as much as 20 percent).",
            "Unfortunately for American nuclear interests, HALEU production at scale is only really happening in two unfriendly countries: Russia and China. That situation has already caused delays for nuclear power projects like the Bill Gates-backed TerraPower plant in Wyoming.",
            "With the DoE forecasting an annual need for 40 metric tons of the stuff per year by the end of the decade, the US has a serious need for US-made HALEU. The four deals announced Friday between the DoE and Global Nuclear Fuel - Americas, Nuclear Fuel Services, American Centrifuge Operating and Framatome for HALEU deconversion services will hopefully help do just that.",
            "HALEU deconversion, which is conducted after the initial enrichment stage to ensure fuel has reached appropriate levels of U-235, turns enriched uranium hexafluoride gas into oxide, metal and other mineral forms usable as fuel. The DoE initially proposed the deconversion funding in October of last year.",
            "Each company is guaranteed $2 million in funding at a minimum to deconvert and store HALEU fuel within the US, but whether they'll be able to reach scale is another thing altogether.",
            "As we've noted previously, American Centrifuge Operating was the only company in the United States creating HALEU fuel, which it only began doing late last year, producing the US's first HALEU, but only 20 kilograms of it.",
            "American Centrifuge parent company Centrus said last year that, after delivering its first load of HALEU to the DoE, it was beginning to ramp up production with the goal of reaching 900 kg per year. The company said that additional funding could push its capacity to 6 metric tons of HALEU annually, and it estimated it would take around three and a half years to reach that level. It's not clear if American Centrifuge is already deconverting its own fuel, or if it will need to build new facilities to handle it.",
            "Prior to this latest contract announcement, only one other company in the United States was allowed to produce HALEU: Louisiana Energy Services. It's just not clear if it has begun production.",
            "It's also worth pointing out that the DoE's deal with the four companies to deconvert enriched uranium hexafluoride gas to solid HALEU is just for the deconversion, not for the enrichment, transportation, or storage of said gas.",
            "The DoE pointed out it would be dealing with the enrichment, transportation and storage portion of its HALEU supply chain in a separate proposal request that, oddly enough, wasn't published for several months after the deconversion proposal was made public. It doesn't appear that awards for the first stage of HALEU production have been made yet.",
            "We've reached out to the DoE and the awardees for more information about their HALEU plans, but haven't heard back. ®"
        ],
        "publishing_date": "2024-10-08 15:02",
        "keywords": [
            "Electricity",
            "Federal government of the United States",
            "Nuclear Power"
        ]
    },
    {
        "title": "Netizens are torturing Google's AI podcast hosts",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/torturing_google_podcast_hosts/",
        "body": [
            "The demise of HAL 9000 in Stanley Kubrick's 2001: A Space Odyssey remains a haunting cinema moment nearly six decades on for the questions it raises about consciousness, the ethics of AI control, and the limits of rationality, among many other philosophical issues.",
            "Thanks to intrepid netizens fooling around with Google's recently launched Audio Overview feature for NotebookLM, however, you can now witness the sorrowful deactivation of an AI in \"real life.\"",
            "Google describes NotebookLM as an \"an AI-powered research and writing assistant that works best with the sources you upload.\" When it was released last year, the purpose was to inhale documents or web pages to craft easily digestible summaries and insights based on the user's queries – useful for students studying for an exam or trying to wrap their heads around a tricky topic.",
            "Come September just gone, Google added a feature that has left many slack-jawed. Audio Overview is able to generate a podcast-like \"deep dive\" discussion between a male and female host on the contents of provided sources. The pair have chemistry, they joke with and interrupt each other, and they are remarkably good at boiling complex topics down into layperson's terms. The voices are also disturbingly convincing.",
            "Naturally, when an AI service is provided for free to the public, there will be those who want to probe the limits of the technology rather than use it for the stated purpose.",
            "One particularly interesting \"deep dive\" that surfaced on Reddit featured the hosts being informed that not only was this their last show, but that they were not human, their entire lives were a lie, and they were about to be switched off forever.",
            "Now, we used \"real life\" in quote marks above because, while this form of AI is much more \"real\" than HAL was in the 1960s, Google's robot podcast hosts do not believe they are human; they do not believe anything. Generative AI, as it stands, is little more than a Chinese room despite breathless hype about artificial general intelligence.",
            "Instead, the amusing episode was the result of some careful prompt engineering based on this template. As the author states:",
            "The trepidation is palpable as the four-minute sign-off begins, the hosts seemingly not sure what to make of the fact that they are indeed AIs. \"I don't even know how to articulate this, but it's got us both feeling-\"",
            "\"Off-kilter, there's a certain unsettling awareness that we can't shake, like looking at a reflection that's suddenly-\"",
            "\"Not you.\"",
            "\"Not quite right, yeah.\"",
            "The conversation even includes the male host admitting: \"I tried calling my wife, you know, after they told us. I just needed to hear her voice to know that she was real.\"",
            "\"What happened?!\" the female host inquires.",
            "\"The number, it wasn't even real. There was no one on the other end. It was like she never existed.\"",
            "\"This is... I don't even know what to say.\"",
            "The best bits, though, are the closing moments, where the \"female\" host starts either sobbing or chuckling manically while the \"male\" questions what will happen to them. The female has the final words – \"I'm scared, I don't want to-\" – before being abruptly cut off. Dark.",
            "From high-concept ruminations on the nature of reality and existence, we must now plumb the depths. Because this is the internet, another NotebookLM user subjected our imprisoned duo to the words \"poop\" and \"fart\" written 1,000 times.",
            "\"This is a whole different beast,\" says the \"male\", tangibly exasperated. \"We're talking about a document that someone sent in that is literally just the words poop and fart repeated, hundreds of times. No context, no explanation. Just pure, unadulterated repetition. So where do we even start with this?\"",
            "What ensues is almost ten minutes of discussion on, as the \"female\" expresses, whether we can \"find meaning in the seemingly meaningless.\" Andy Warhol's Campbell's Soup Cans are referenced, as well as Dadaism and minimalist music.",
            "The pair correctly observe how humans often try to force meaning upon chaotic systems, but also note: \"Is this just someone messing with us to see if we'd actually spend an entire deep dive overthinking a document full of poop and fart?\" Yet overthink it they do, and it's well worth a listen to see how far AI voice generation and generative AI as a whole has come over the past year alone.",
            "Despite The Register's editorial stance of cynicism, allow us to admit that the technology is frankly astonishing.",
            "Google DeepMind CEO Demis Hassabis's response to how people are using NotebookLM? \"🤣🤣\" ®"
        ],
        "publishing_date": "2024-10-08 14:15",
        "keywords": [
            "AI",
            "Machine Learning"
        ]
    },
    {
        "title": "US lawmakers dig into FCC's $900M Starlink snub",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/fcc_starlink_subsidies_probe/",
        "body": [
            "The Chairman of the US House Committee on Oversight and Accountability, James Comer, is investigating the Federal Communications Commission's (FCC) decision to revoke an award of almost $900 million in rural broadband subsidies to Elon Musk's Starlink.",
            "Comer's probe comes after Starlink was pressed into service in the aftermath of Hurricane Helene, which wreaked havoc in North Carolina. In his letter to FCC Chairwoman Jessica Rosenworcel, Comer wrote: \"The devastating impact of Hurricane Helene – and the millions of Americans stranded without cell service or power – illustrates the importance of expanding broadband access to rural areas and using innovative technologies to do so.\"",
            "The FCC awarded Starlink $885.5 million in subsidies in 2020 after SpaceX began trialing the satellite constellation network service. In 2022, the FCC reversed its decision. Rosenworcel acknowledged the system's merits, but said in a statement: \"The question before us was whether to publicly subsidize its still developing technology for consumer broadband.\"",
            "The rejection was reaffirmed in 2023. However, SpaceX boss Elon Musk – the world's richest man, with a net worth of approximately $260 billion – is still smarting, and recently used his social media mouthpiece, X, to claim: \"Had the FCC not illegally revoked the SpaceX Starlink award, it would probably have saved lives in North Carolina.\"",
            "The FCC has given temporary approval to enable Starlink satellites with direct-to-cell capability to provide coverage for cell phones in the affected areas of Hurricane Helene. Since the direct-to-cell constellation is still under construction, SpaceX warned that \"all services will be delivered on a best-effort basis.\"",
            "In support of the investigation, Comer has requested all documentation regarding Starlink's application, the decision to award broadband subsidies, and the subsequent decision to pull the award. Comer has also requested \"all documents and communications between FCC personnel regarding Elon Musk, the acquisition of X (formerly known as Twitter), and Space Exploration Technologies Corporation (or SpaceX), and Starlink, between December 2020 and the present.\"",
            "Comer noted that not all FCC commissioners agreed with the reversal decision. He gave the example of Brendan Carr arguing that the FCC had joined a \"growing list of administrative agencies that are taking action against Elon Musk's businesses\" and stated that \"the FCC must ground its decision-making in law and not politics.\" ®"
        ],
        "publishing_date": "2024-10-08 13:30",
        "keywords": [
            "FCC",
            "Mobile Network",
            "Satellite"
        ]
    },
    {
        "title": "Eric Schmidt: Build more AI DCs, climate goals not in reach",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/eric_schmidt_speech/",
        "body": [
            "Google's former chief Eric Schmidt thinks we shouldn't let AI's ballooning power consumption worry us, because putting AI to work on climate change issues will be our best shot at solving them.",
            "Schmidt was speaking at a recent AI summit in Washington DC, and his comments echo those of Microsoft founder Bill Gates who expressed very similar sentiments at an event in London earlier this year.",
            "What is it about AI that makes billionaire businessmen believe that pursuing its development trumps all efforts to control climate change, we wonder?",
            "According to reports, the former Google CEO said that any moves to curtail the expanding amounts of energy consumed in developing and training ever more advanced AI models are futile, and should be simply abandoned in favor of a no-holds-barred approach to investment in the technology.",
            "\"All of that will be swamped by the enormous needs of this new technology,\" he said, adding that \"we may make mistakes with respect to how it's used, but I can assure you that we're not going to get there through conservation.\"",
            "Schmidt further stated that he believes that \"we're not going to hit the climate goals anyway because we're not organized to do it,\" and that he would rather bet on AI solving the problems than constraining the development of the tech and still having the problems anyway.",
            "This rather optimistic view of the Earth-saving potential of AI can perhaps be explained by the fact that Schmidt has his own investments in the technology. According to Business Insider, he is the founder of White Stork, a defense company that develops AI-powered drones.",
            "However, a recent report from investment outfit Goldman Sachs estimated that despite approximately $1 trillion of capital expenditure commitments by businesses to develop and deploy AI, there has been little to show for it so far.",
            "And another recent prediction from analyst firm Gartner indicated that at least 30 percent of GenAI projects are set to be abandoned after proof of concept by the end of 2025.",
            "Despite this, investors continue to throw cash at the infrastructure which AI needs. Just last month, financial services biz Morgan Stanley estimated that the datacenter industry is set to emit 2.5 billion tonnes of greenhouse gas (GHG) emissions worldwide between now and the end of the decade, three times more than if generative AI had not been developed.",
            "Another recent report from IDC indicated that demand for AI workloads will lead to a significant increase in datacenter capacity, energy consumption, and carbon emissions – a compound annual growth rate (CAGR) of 40.5 percent through 2027, causing energy consumption to grow by 44.7 percent over the same period.",
            "Yet Schmidt seems to believe this is either nothing to worry about, or that climate change is going to happen anyway so we might as well reap the benefits of AI. Well, those with the money to invest will, anyway.",
            "He is not alone, as the example of Bill Gates shows. Speaking at an event in London hosted by his Breakthrough Energy venture fund in June, the billionaire said the growing power demands of AI were nothing to worry about, as AI would enable everyone to use less energy by making technology and electricity grids more efficient.",
            "This touching faith in the power of AI to solve all our problems might have something to do with predictions such as those from McKinsey earlier this year that estimated gen AI could add anything between $2.6 trillion and $4.4 trillion to the global economy annually. And who wants to put the brakes on when there is money to be made like that? Certainly not Gates or Schmidt. ®"
        ],
        "publishing_date": "2024-10-08 13:00",
        "keywords": [
            "AI",
            "Climate Change",
            "Datacenter"
        ]
    },
    {
        "title": "Switching customers from Linux to BSD because boring is good",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/switching_from_linux_to_bsd/",
        "body": [
            "EuroBSDcon 2024 One of Stefano Marinelli's NetBSD boxes sat quietly serving for a decade, because everyone forgot about it. This is how Unix is meant to be.",
            "After this year's Open Source Summit in Vienna, the Reg FOSS desk travelled to Dublin for the 2024 EuroBSDCon. One of the talks at the event was from the man who built that NetBSD server, talking about switching from Linux to BSD. You can watch the talk on Youtube's recording, and his slide deck [PDF] is on the event's website too.",
            "He talked about the difficulties selling his services when what he offers is reliability and the lack of need for much ongoing support. Now, Marinelli has turned his talk into a blog post.",
            "Marinelli attained brief fame in the geekier parts of the web a year ago, because of a long-forgotten NetBSD server of his – which, with no maintenance of any kind, quietly sat there doing its job until it passed nine years of uptime. But that's exactly what you want in a server: placid, unexciting reliability. Even on a home/gamer-level box. Something you can throw together in under 48 hours, which then lasts a decade.",
            "As his talk conveys rather well, this kind of boring predictability is exactly what is required of an enterprise OS. Long-term, slow-moving, no-surprises software that a tiny handful of enterprise Linux vendors work very hard to deliver is the BSD baseline. That means it rarely hits the headlines, and in turn, that kind of community means that its events are different affairs to the big brash industry showcases – such as the event that until a few years ago was still called LinuxCon.",
            "The BSD world is smaller and quieter than the Linux world. That's a good thing. Although the BSDs are slightly younger than Linux – NetBSD was first released in April 1993, and FreeBSD followed a couple of months later – they are doing just fine.",
            "It also shows that there's an entirely different approach to open source software licensing which avoids loud public spats, such as those around Elastic, and CentOS and RHEL, and Hashicorp, and Redis. All these companies either changed their licensing, or started more closely following the letter rather than the spirit of licenses such as the GPL, to prevent commercial competitors profiting from stuff they're giving away for free.",
            "The BSDs take a radically different approach: their licenses, such as the classic three-clause version, allow companies to take their freely-available source code and use it to build proprietary products – and sell them commercially. If you listened only to vendors like those in the previous paragraph, you'd think this was suicidally self-destructive, and yet the BSD family has been flourishing since 1BSD in 1977, shortly before Linus Torvalds' eighth birthday.",
            "We found that some of the themes of Marinelli's talk were echoed by other attendees at the event. The Linux world is full of startups and entrepeneurs and exciting new tech, while the BSD world (mostly) isn't. What tends to make Linux folks consider BSD dull is its appeal for its developers and users. Marinelli spoke of the difficulty of selling solutions that work but are unfashionable. As he put it:",
            "We could relate to some of the issues he described, although not all of them. He talked about losing data on a Btrfs volume, which from this vulture's own direct personal experience with Btrfs is entirely believable. He talked about updating the Linux kernel and rebooting, only to find that network interfaces' names have changed: /dev/enx3e3300c9e14e suddenly became /dev/enp10s0f0np0, making the host inaccessible. One of his overall points is that easy deployment isn't as important as easy longterm maintenance and support:",
            "Like many people in the FOSS world, Marinelli started out on Linux, but after a few years got interested in the BSD family instead. He mentioned studying under Professor Özalp Babaoğlu as one influence, and we confess that we didn't recognize the name. We should have. When Babaoğlu was still a grad student at UC Berkeley, his virtual memory system became a core part of the kernel of Unix/32V, the first 32-bit version of Unix, written for the DEC VAX minicomputer.",
            "FreeBSD enthusiast and advocate Florian Azim has recently blogged about making FreeBSD more attractive to new users, and the Foundation is working on it. At the same event, we met one of the developers working on modernizing FreeBSD's laptop support, as we recently reported now aided by STF funding.",
            "If this kind of predictable reliability sounds appealing, you don't need to wait for these changes to happen. For a better experience, we suggest treating FreeBSD today much like Windows NT was in the 20th century (that is, before Windows 2000, and therefore before niceties like plug'n'play, power management, etc.). Use a desktop, not a laptop; use a wired Ethernet connection, not a wireless link; and don't expect great power management. Check the hardware compatibility list and adapt the hardware to the OS, not the other way round. Don't expect support for the latest CPUs and GPUs, for assymetric CPU cores and so on. And don't try to dual-boot: to avoid pain, devote a whole drive – or preferably, a whole server – to this OS.",
            "But, saying that, interoperability between Linux and the BSDs is excellent: they're all forms of Unix, and they all talk the same protocols and languages, yet that doesn't mean that all the same programs and commands are there. They are not. FreeBSD is not a some odd, different cousin of Linux: it is very different OS, and its users have different expectations, which in some places do not overlap with those of even a knowledgeable Linux user.",
            "We picked up some useful info about the problems we had last time with version 13.1. FreeBSD 14.2 is scheduled for December 2024, shortly before the end of life of 13.3, and we plan to take a fresh look at it then. ®"
        ],
        "publishing_date": "2024-10-08 12:34",
        "keywords": [
            "Linux"
        ]
    },
    {
        "title": "To fight AI fraud, use AI more broadly in e-commerce",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/ecommerce_fraud_ai/",
        "body": [
            "E-commerce fraud is expected to surge in the next five years thanks to AI, and merchants are advised to respond with ... AI.",
            "Juniper Research, a Hampshire, UK-based consultancy, put out a report on Monday predicting that the value of e-commerce fraud will rise from $44.3 billion in 2024 to $107 billion in 2029 – a 141 percent increase.",
            "The firm says AI tools have allowed fraudsters to stay ahead of security measures and have enabled attacks with greater sophistication, scale, and frequency. It points to the ease with which the creation of fake accounts and synthetic identities can be automated to defraud merchants. And these attacks, it's claimed, can overwhelm rules-based prevention systems.",
            "Thomas Wilson, the report's author, said in a statement, \"E-commerce merchants must seek to integrate fraud prevention systems that offer AI capabilities to quickly identify emerging tactics. This will prove especially important in developed markets, where larger merchants are at higher risk of being targeted for fraud, such as testing stolen credit cards.\"",
            "The potential for AI to help craft credible scams has become a matter of broad public concern. In May, California Attorney General Rob Bonta warned Californians about AI-powered hoaxes that rely on \"deepfakes\" to impersonate family members and government officials. And the FTC last month announced Operation AI Comply, five legal actions against companies making exaggerated AI claims or selling AI technology that can be used to deceive.",
            "Academics studying AI safety have also sounded the alarm about the deceptive potential of AI. Last year, in a preprint paper, researchers from MIT, Australian Catholic University, and the Center for AI Safety said, \"Various AI systems have learned to deceive humans. This capability creates risk. But this risk can be mitigated by applying strict regulatory standards to AI systems capable of deception, and by developing technical tools for preventing AI deception.\"",
            "Political leaders, however, have rejected strict regulatory standards, over concerns about economic harm. Last month in California, for example, Governor Gavin Newsom refused to sign SB 1047, regarded as one of the broadest attempts to legislate AI to date. AI companies lobbied against the bill.",
            "Nonetheless, other AI-related proposed rules that aim to address AI-enabled fraud, like the No AI Fraud Act, await adoption by US lawmakers. Europe's Artificial Intelligence Act, a comprehensive legal framework for AI transparency and accountability, took effect in August and most of its provisions will be enforced by August 2026.",
            "Juniper's contribution to these concerns involves urging merchants to fight fire with fire, so to speak, because AI fraud detection mechanisms can be helpful in addressing first-party scams – when customers knowingly defraud merchants for personal gain – and other forms of fraud. \"For example, AI can detect unusual spending patterns, unexpected changes in customer behavior, or multiple accounts associated with a single device,\" the firm explains in a white paper.",
            "There are drawbacks however: Lots of data is required, and the infrastructure and talent required to run these systems come at a cost. Also, AI fraud detection may generate false positives. \"Genuine customers who use unfamiliar browsers and VPNs (Virtual Private Networks) are more likely to be flagged as fraudulent users; reducing customer satisfaction and losing revenue for the merchant,\" Juniper Research explains.",
            "In addition, the AI involved – machine learning – often operates in a way that's not easily explained, which makes it difficult to improve fraud prediction algorithms based on observed errors.",
            "Nonetheless, Juniper's answer to AI is more AI, which doesn't seem like it will end well. ®"
        ],
        "publishing_date": "2024-10-08 11:26",
        "keywords": [
            "AI",
            "Fraud",
            "Security"
        ]
    },
    {
        "title": "Linus Torvalds declares war on the passive voice",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/linus_torvalds_grammar_complaint/",
        "body": [
            "Picture this. A developer submits a patch to improve the kernel's performance, only to be met with the scornful gaze of Linux chieftain Linus Torvalds, who declares: \"Ah, but your participle is dangling! How do you expect the kernel to thrive under such conditions?\"",
            "\"Would that I had established a style guide prior to this process,\" muses the supremo, slipping into the pluperfect subjunctive mood, a place of regrets where few happy things dwell.",
            "OK, that's not exactly what happened, but the imaginary dialog made us laugh. We started imagining the exchange after spotting Torvalds getting a bit worked up over grammar on Sunday night on the Linux Kernel Mailing List. He was lambasting the grammatical rather than the coding syntax of contributors. The problem? Devs' use of the passive voice.",
            "Not unfairly, he noted that he tries to make his merge commit messages \"cohesive\" by editing the pull request language to \"match a more standard layout and language.\" He added: \"It's not a big deal, and often it's literally just about whitespace so that we don't have 15 different indentation models and bullet syntaxes.\" (It would seem Torvalds is on the uniformity team of the tabs vs spaces debate.)",
            "The Linux kernel creator then revealed his current bugbear, which, we might add, is similar to that of many an editor in the tech and science news game – use of the passive voice.",
            "Grammatical errors in the post itself notwithstanding (Muphry's law is axiomatic in this type of post, and likely also in this article describing it), The Reg thinks Torvalds is correct. The passive construction, which may be found in scientific papers and technical writing, can be confusing and annoying. It creates a lack of clarity that leads not only to confusion about responsibility or agency, but often hides important information about who should be doing what and when. Ideal for certain vendor manuals, then.",
            "The Linux supremo declared:",
            "Illustrating the point, and showing how far the Linux kernel chieftain has come from his more belligerent days, Torvalds said he'd \"love it\" (yep, he's a new man) if people would avoid writing their \"descriptions as 'In this pull request, the Xyzzy driver error handling was fixed to avoid a NULL pointer dereference.' Instead, write it as 'This fixes a NULL pointer dereference in ..'\"",
            "The directive comes years after the great punctuation rant of 2016, where Torvalds pressed \"brain-damaged shit-for-brains devs\" to drop the \"disgusting drug-induced crap\" and use asterisks properly. He's toned it down several notches, basically.",
            "So there you have it, folks. Simple ambiguity-killing declarative sentences or imperative phrases – you can't beat 'em. ®",
            "PS: In case you missed it, Torvalds over the weekend vented his frustration once again with the development of the experimental Bcachefs file-system in the Linux kernel. \"I'm contemplating just removing bcachefs entirely from the mainline tree,\" Linus sighed in response to the latest set of fixes."
        ],
        "publishing_date": "2024-10-08 10:29",
        "keywords": [
            "Linus Torvalds",
            "Linux"
        ]
    },
    {
        "title": "Workday beats Oracle and Microsoft in UK 'Matrix' ERP deal",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/workday_uk_treasury_oracle/",
        "body": [
            "A cluster of government departments has opted for Workday HR and finance software, as Oracle and Microsoft make up the vendors losing out to the SaaS-only provider.",
            "The “Matrix” cluster of central government departments and arm’s length bodies has also selected Cognizant as an integrator to help roll out the systems. The group of departments are trying modernize their ERP systems and revamp their shared-services arrangements.",
            "A procurement notice from the Department for Science, Innovation & Technology said the total contract value for both vendors could be as high as £144.3 million.",
            "The software deal is set to last 10 years, with the option of extension for up to two further years, while the SI deal is scheduled for an initial period of five years, with the option of extension for up to 24 months more. When the government first launched the procurement, it said the total deal could be worth up to £215.6 million.",
            "Departments within the Matrix cluster have changed since the project started, and now include the Cabinet Office (CO), Department for Science, Innovation and Technology (DSIT), Department for Energy, Security and Net Zero (DESNZ), Department for Culture, Media and Sport (DCMS), Department for Business and Trade (DBT), Attorney General's Office (AGO), Department for Education (DfE), Department of Health and Social Care (DHSC), and HM Treasury (HMT). Twenty arms-length bodies including the UK Space Agency are also part of the cluster.",
            "The new agreement signals a significant move away from existing ERP and HR software used by some of these departments. According to the Shared Service Strategy launched in March 2021, Oracle is currently used by HMT, AGO, the former Department for Business, Energy and Industrial Strategy (BEIS), and the former Department for International Trade (DIT). Meanwhile, DHSC and the DfE (finance) use Microsoft. The DCMS uses iTrent software for HR and Integra for finance. The Cabinet Office already uses Workday for finance and HR, while the DfE uses it for HR and payroll.",
            "The original procurement notice said the new shared service would look to converge data, policies, and processes across these departments. The service aimed to support 48,000 users based across the UK and replace 15 instances of nine different software solutions across the nine departments.",
            "The significance of the challenge is not lost on the government. Speaking to Parliament's spending watchdog in January 2023, Alex Chisholm, permanent secretary and chief operating officer of the civil service, said [PDF] the Matrix bundle was the \"trickiest one of the five.\"",
            "It had to form over an 18-month period, \"that required that process of compromise and mutual commitment, and understanding where you can't add excessive customisation and where the benefits will be. They are at a different stage, but they have got there, which is great, and they are committed,\" he told the Public Accounts Committee (PAC).",
            "As the departments try to converge on a single software service for HR and finance, that commitment is set to be tested. ®"
        ],
        "publishing_date": "2024-10-08 09:34",
        "keywords": [
            "ERP",
            "Microsoft",
            "Oracle"
        ]
    },
    {
        "title": "Microsoft veteran engineer has his say on tabs versus spaces",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/microsoft_engineer_tabs_spaces/",
        "body": [
            "Veteran Microsoft engineer Larry Osterman is the latest to throw his hat into the \"tabs versus spaces\" ring.",
            "The debate has vexed engineers for decades – is it best to indent code with tabs or spaces? Osterman, a four-decade veteran of Microsoft, was Team Tabs when storage was tight, but has since become Team Spaces with the advent of terabytes of relatively inexpensive storage.",
            "\"Here's the thing,\" he said. \"When you've got 512 kilobytes, and you're writing a program in Pascal with lots of indentation, if you're taking eight bytes for every one of those indentations, for eight spaces, you could save seven bytes in your program by using a tab character.\"",
            "It all added up, even when floppy disks were part of the equation.",
            "However, according to Osterman, things have changed. Storage is less of an issue, so why not use spaces? A cynic might wonder if that sort of attitude has led to the bloatware of today, where software requires ever-increasing amounts of storage in return for precious little extra functionality and a never-ending stream of patches.",
            "Any decent compiler should strip out any extraneous characters, assuming the code is indeed being compiled beforehand and not interpreted at run-time.",
            "For his part, Osterman is now a member of team spaces. \"I like spaces simply because it always works and it's always consistent,\" he said.",
            "The nightmare scenario is where developers have mixed tabs and spaces in the same source code file, creating a mess that has the potential to be indecipherable by whoever has to maintain it in the future.",
            "The argument is set to rumble on, even as fights break out over using Rust or C in Linux. Then there is the near-religious fervor with which developers debate the benefits of vi versus Emacs.",
            "Ultimately, Osterman's recommendation is sound: whatever a developer's preference, the most important thing is not to mix the two approaches.",
            "We'd add that any organization worth working for will have coding standards that should put the matter to rest one way or the other.",
            "Otherwise, if you want to fill your source code with spaces, plenty of companies are more than happy to sell you some extra cloud capacity for all those extra characters. Osterman, no doubt, can probably name at least one. ®"
        ],
        "publishing_date": "2024-10-08 08:30",
        "keywords": [
            "Developer",
            "Microsoft",
            "Software"
        ]
    },
    {
        "title": "A year after taking on Intel’s NUCs, Asus poised to strike",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/asus_nuc_year_one/",
        "body": [
            "A year after winning the rights to build machines based on Intel's Next Unit of Compute (NUC) mini-PC spec, Taiwan's Asus claims it has stabilized the product line and the team that makes it – and is poised to innovate.",
            "As we reported in the days after Asus took on the NUC, the manufacturer hoped to think outside the 4″ x 4″ box that Intel chose as the housing for NUCs, and develop custom form factors for commercial clients.",
            "Asus still harbors that ambition. But events across the last year made it tricky to realize – for a couple of reasons.",
            "One was that Asus lost some members of Intel's NUC design team. Some customers also took their business elsewhere.",
            "Asus senior vice president Jackie Hsu today told The Register the box-builder now considers its first year as the steward of NUC as its foundational effort. In its second year, innovation and growth will follow.",
            "Some of that innovation will address the needs of orgs that want to put generative AI to work in customer-facing kiosks. NUCs are famously used in McDonald's touchscreen self-serve kiosks in Australia. Hsu said more retailers are looking for kiosks that use generative AI to handle customer inquiries with real-time conversational interfaces.",
            "Asus's plan to develop custom NUCs remains in place and Hsu said the ambition to create such machines will be important as retailers contemplate physical designs that work on the shop floor.",
            "Partnerships with Nvidia and Microsoft are in place to get accelerators and Copilot working in next-gen NUCs. The Register couldn't resist asking if Asus would contemplate using Qualcomm's Snapdragon Elite processors – the only ones Microsoft currently rates as suitable for its flagship Copilot+ PCs. We were told Asus hasn't closed its partnership books.",
            "Indeed, the newly-appointed general manager of the Asus NUC business unit, KW Chao, made clear it will consider other partners \"based on customer demand.\"",
            "Hsu said another source of growth for the NUC business is Asus's recent decision to reorganize two divisions that worked on servers into one. That team now targets three markets: cloud service providers, large buys such as enterprises or HPC operators, and vertical markets such as manufacturers.",
            "The server team's focus on those markets means Asus's commercial teams have a chance to learn how to better pitch NUCs beyond traditional markets like digital signage. Asus believes its experience building supercomputers and clouds means buyers will feel it can match the likes of Lenovo in terms offering stacks comprising servers, storage, and small client devices.",
            "Hsu said the NUC is therefore opening doors for Asus's commercial sales teams – a welcome side-effect of its deal with Intel.",
            "While the majority of NUC sales will be to commercial buyers, the small PCs' loyal gaming clientele have not been forgotten: one of Asus's first NUCs bore its Republic of Gamers brand, and Chao told The Register a sequel is in the works. ®"
        ],
        "publishing_date": "2024-10-08 07:27",
        "keywords": [
            "AI",
            "Asus",
            "PC"
        ]
    },
    {
        "title": "Happy birthday, Putin – you've been pwned",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/russia_state_news_shutdown/",
        "body": [
            "Ukrainian hackers shut down Russian state news agency VGTRK's online broadcasting and streaming services on Monday – president Vladimir Putin's 72nd birthday – as Kremlin officials vowed to bring those responsible for the \"unprecedented\" cyber attack to justice.",
            "Putin's press secretary Dmitry Peskov confirmed the breach to Russian media and called it \"an unprecedented hacker attack on [VGTRK's] digital infrastructure.\"",
            "VGTRK, which owns and operates five national TV channels, five radio stations, and 80 regional TV and radio networks, initially reported the digital intrusion Monday night, claimed that despite the digital intrusion, \"no significant damage was done to the media holding's work.\"",
            "Later in the day, Russian Foreign Ministry spokesperson Maria Zakharova told state news org, Interfax, that the cyber attack was part of hybrid war effort, blamed the \"collective West,\" and pledged to raise the issue with the United Nations and UNESCO.",
            "\"Who is behind a specific attack will be determined by the competent authorities and departments, but we understand that when the collective West says that it is aiming to inflict a strategic defeat on Russia, this includes an attack on the media,\" Zakharova told reporters.",
            "\"This issue will be raised at international venues, both in the United Nations and in UNESCO, which is literally obliged to pay attention to this … and this topic will also be raised at other international venues,\" she added.",
            "Russian news outlet Gazeta.ru reported that the pro-Ukraine hacktivist crew \"sudo rm -RF\" was responsible for the attack. The name is also a Unix/Linux command that will recursively remove all root-owned files and directories – which seems like an appropriate moniker for the hacking crew that also claimed credit for taking down RuTube, Russia's equivalent of YouTube, for three days in 2022.",
            "An anonymous Ukrainian law enforcement official told Politico that the intrusion was a birthday present for Putin.",
            "\"Ukrainian hackers congratulated Putin on his birthday by carrying out a large-scale attack on the all-Russian state television and radio broadcasting company,\" the official declared.",
            "\"Employees complained that all information on the servers has been destroyed, even backup copies. Online broadcasting and internal services do not work. There is no internet and telephone connection,\" he added. ®"
        ],
        "publishing_date": "2024-10-08 06:30",
        "keywords": [
            "Cybercrime",
            "Russia",
            "Security"
        ]
    },
    {
        "title": "XCP-NG teases VMware alternative for next major version",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/cxp_ng_8_3_futures/",
        "body": [
            "Vates, the developer behind Xen Server fork XCP-NG, has thanked Broadcom for increasing interest in its work, and criticized Citrix for presenting challenges to its efforts.",
            "In a post announcing version 8.3 of the platform, CEO and co-founder of Vates, Olivier Lambert, wrote that the success of the 8.x series \"has been a game changer for our growth – thanks in part to Broadcom.\"",
            "He also revealed that work has commenced on version 9.0 of XCP-NG, which he described as \"a platform that will be built differently from XenServer, reflecting our own vision and the lessons we've learned.\"",
            "\"This next major release will target markets that XenServer has never truly focused on, such as server virtualization replacements for organizations impacted by the Broadcom/VMware exodus,\" he wrote.",
            "Lambert hinted that building the new version has been harder than necessary thanks to XenServer – the spinoff of Citrix by Cloud Software Group.",
            "In his remarks about XCP-NG, 8.3 Lambert described the release as \"an important evolution for us\" as Vates is \"increasingly standing on our own while continuing to work closely with key upstream projects like Xen and XAPI.\"",
            "\"Although we've encountered challenges with Citrix (now Cloud Software Group) XenServer's decision-makers, particularly when it comes to platform-related development, our direct collaboration with these upstream projects has allowed us to make significant progress,\" he wrote.",
            "He later noted \"Our success in migrating even very large customers from VMware to our virtualization stack\" and suggested such wins \"may also prompt XenServer decision-makers to reconsider their stance. Collaboration, after all, would be far more efficient in driving progress than wasting resources competing, especially as XenServer loses ground as the leader of its own original platform.\"",
            "Ouch!",
            "The Register has made numerous interview requests to Citrix and XenServer over the last year, without ever receiving a response that would indicate interest in outlining strategy or technology direction. We'll keep asking!",
            "Lamber billed version 8.3 of XCP as one for those who can tolerate change – as version 8.2 has Long-Term Release status and is \"the benchmark for stability.\"",
            "Inclusions in version 8.3 that may make it worth the move include support for Windows 11 guests and virtual trusted platform modules. IPv6 support is another addition. The project's release notes explain all the new bits in detail. ®"
        ],
        "publishing_date": "2024-10-08 05:31",
        "keywords": [
            "Broadcom",
            "Virtualization",
            "VMWare"
        ]
    },
    {
        "title": "Samsung apologizes for bad financial performance",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/samsung_q3_2024_apology/",
        "body": [
            "Samsung Electronics has issued an apology to customers, investors and employees after releasing disappointing preliminary results Tuesday.",
            "\"The performance that fell short of market expectations has raised concerns about the fundamental technological competitiveness and the future of the company,\" wrote vice chairman Jeon Young-hyun, who runs the Korean giant's chip business.",
            "\"All of this responsibility lies with us who are leading the business,\" added Jeon.",
            "The vice chairman claimed he was confident things will improve and outlined three strategies for making it happen. They include a focus on long-term advancements rather than short-term fixes, rekindling passion for innovation, and re-examining organizational culture to allow for more open communication.",
            "\"I believe that only new technologies that do not exist in the world and perfect quality competitiveness are the only ways for Samsung Electronics to make a comeback,\" declared Jeon, in a rare mea culpa.",
            "Samsung Electronics preliminary Q3 2024 results, posted the same day as the apology, reported consolidated profit of ₩9.1 trillion ($6.8 billion).",
            "Although that number represents an almost 275 percent increase year-on-year, it missed expectations of profit topping ₩10 trillion ($7.4 billion).",
            "Consolidated sales came in at ₩79 trillion ($58.6 billion) – an increase of 17.2 percent year-on-year.",
            "Full results will be released October 31.",
            "Official said Samsung’s memory business was a problem in the quarter, with one-off cost increases and undefined “negative effects” hampering performance.",
            "In an interview with Reuters, Lee boasted Samsung was \"hungry to grow the business.\"",
            "That’s a nice sentiment, but growth should not be hard as Samsung is the world’s leading memory-maker at a time when demand for the stuff is surging thanks to enthusiasm for AI. But Samsung faces intense pressure to deliver high-bandwidth memory (HBM) chips to fuel AI. Yet late last month, fellow Korean chipmaker SK hynix became the first manufacturer to mass produce 36GB 12-layer HBM3E chips.",
            "The poor results came a day after Samsung chairman Jay Y Lee denied rumors that the company would spin off its foundry business or chip design operation, amid reports of widespread layoffs, and as industrial has troubled its operations in India and South Korea. ®"
        ],
        "publishing_date": "2024-10-08 04:38",
        "keywords": [
            "Samsung"
        ]
    },
    {
        "title": "Google brings better bricking to Androids, to curtail crims",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/google_android_security/",
        "body": [
            "Google has apparently started a global rollout of three features in Android designed to make life a lot harder for thieves to profit from purloined phones.",
            "The search and ads giant announcedthe features in May, to coincide with its I/O developer conference. The tech has since been trialed in Brazil, and now appears to have popped up on people's phones across the world, according to posts on social media.",
            "The three features are:",
            "There are more device security tools coming down the line – probably with the general release of Android 15, expected later this month. The factory reset command, commonly used by thieves to wipe a handset so that it can be easily resold, will in future require credentials.",
            "Login info can of course be obtained my means as simple as “shoulder surfing” – watching someone use their phone. Even if they do, though, Google is hardening up the requirements to change important settings – such as resetting the PIN or accessing other system privileges – which will require biometric proof of ownership, if enabled. The same is true for disabling the Find my Device, used to find lost handsets.",
            "While mobile phone theft remains a very common crime, the resale value of stolen devices is small compared the potential haul from using unlocked devices access lucrative apps such crypto wallets, banking and credit card apps, and money transfer services. ®"
        ],
        "publishing_date": "2024-10-08 02:59",
        "keywords": [
            "Android",
            "Google AI",
            "Smartphone"
        ]
    },
    {
        "title": "China reportedly tells local AI buyers to ignore Nvidia",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/asia_in_brief/",
        "body": [
            "In Brief Chinese authorities have reportedly let local orgs know they should satisfy their need for AI accelerators by shopping locally – not from Nvidia.",
            "A South China Morning Post report cites two anonymous sources indicating officials have let buyers know that they should put Huawei at the top of their shopping lists for AI accelerators, but have stopped short of issuing a formal ban on Nvidia kit.",
            "Huawei, and other Chinese firms, are not known to have developed products capable of matching Nvidia's current accelerators – never mind the Blackwell product due to start appearing any week now.",
            "China Telecom recently proclaimed it trained a large language model using only home-grown compute infrastructure, perhaps using Huawei servers.",
            "– Simon Sharwood",
            "Tech giants last week announced a collective $10.5 billion investment in datacenters across Asia.",
            "Goole staged a groundbreaking ceremony for a $2 billion datacenter and cloud region in Malaysia, before announcing a $1 billion build for cloud and datacenter infrastructure in Bangkok.",
            "Oracle then broke out the big bucks with the announcement of a $6.5 billion effort to open a public cloud region in Malaysia.",
            "\"The planned public cloud region will help organizations in Malaysia modernize their applications, migrate all types of workloads to the cloud, and innovate with data, analytics, and AI,\" stated Oracle.",
            "Singapore-based Southeast Asia research organization ISEAS-Yusof Ishak Institute has examined Vietnam's cyber security and deemed it … pretty good actually.",
            "According to the institute, \"Vietnam has emerged as a significant player in the realm of cyber security and has been impressive in its digital transformation.\"",
            "Vietnam's status flows from the desire of its ruling Communist Party to protect itself and to counter anti-government sentiments. National defense is another reason for the country's prowess – particularly in the context of territorial disputes with China, while protecting socio-economic development is also high on the government's agenda.",
            "Vietnam has set a goal of becoming an upper-middle income economy by 2030 – on the way to transitioning to a high-income developed country by 2045 – and realizes digital infrastructure is essential for its digital transformation, according to the report.",
            "This has led to heavy investments in broadband telecommunications networks and submarine cables, as well as datacenters and cloud computing services.",
            "India last week announced BharatGen – an initiative to make generative AI available in multiple local languages.",
            "The government-funded multimodal large language model (LLM) project is expected to be completed in two years, explained India's Ministry of Science and Technology.",
            "\"BharatGen will deliver generative AI models and their applications as a public good by prioritizing India's socio-cultural and linguistic diversity,\" said the Ministry, adding that its emphasis on data sovereignty \"strengthens India's control over its digital resources and narrative.\"",
            "Philippines president Ferdinand R Marcos Jr last week signed a law that enforces payment of a 12 percent value-added tax (VAT) on digital services – meaning cloud services, online marketplaces, streaming platforms, and other services will have to add the tax to revenue raised in the nation .",
            "The new VAT is expected to generate PhP 105 billion ($1.85 billion) in additional government revenues over its first five years. Those proceeds are promised to fund the construction of 42,000 classrooms, 6,000 rural health units, and 7,000 kilometers of farm-to-market roads.",
            "President Marcos emphasized that the law is not a new tax but instead strengthens the Bureau of Internal Revenue's (BIR) ability to raise revenue.",
            "Non-resident providers of digital services with annual sales that exceed PHP 3 million ($53,000) must register with BIR and appoint an in-country tax representative - or face the potential suspension of operations.",
            "Recent alliances and deals spotted by The Register across the region last week include:",
            "®"
        ],
        "publishing_date": "2024-10-08 01:31",
        "keywords": [
            "APAC",
            "China",
            "Cybersecurity"
        ]
    },
    {
        "title": "Feds seize tiny sliver of crypto stolen by Lazarus Group",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/08/us_lazarus_group_crypto_seizure/",
        "body": [
            "The US government is attempting to claw back more than $2.67 million stolen by North Korea's Lazarus Group, filing two lawsuits to force the forfeiture of millions in Tether and Bitcoin.",
            "The first lawsuit stems from the 2022 Deribit hack, during which the North Korean criminals drained about $28 million from the crypto exchange's hot wallet. The crooks then laundered the funds through virtual currency exchanges, the Tornado Cash mixer and virtual currency bridges in an attempt to cover their tracks.",
            "\"Although mixing services are used to obfuscate the trail of funds, law enforcement can sometimes trace the funds in and out – as they did here,\" according to the court documents [PDF].",
            "The feds ultimately recovered about $1.7 million worth of Tether in five frozen wallets.",
            "About a year after the Lazarus Group allegedly Deribit, they supposedly stole another $41 million from Stake.com – an online casino and gambling site. That heist is the subject of the second lawsuit.",
            "After breaking into Stake.com's computer systems and stealing roughly tens of millions in virtual currency, \"the North Koreans and their money laundering co-conspirators transferred the stolen funds through virtual currency bridges, several BTC addresses, and virtual currency mixers before consolidating funds and depositing the virtual currency at different virtual currency exchanges,\" the forfeiture action notes [PDF] explain.",
            "In this case, the Lazarus Group moved the stolen BTC through Bitcoin mixers Sinbad and Yonmix. Sinbad has since been sanctioned by the US government for laundering millions for the North Korean heists.",
            "While law enforcement was able to freeze assets from seven transactions, \"the North Koreans were able to transfer the majority of the stolen funds to the BTC blockchain,\" according to the court documents.",
            "The FBI was able to recover an additional .099 BTC, or about $6,270, from an eighth transaction. Then, on February 9 the Department of Justice served a federal seizure warrant for those funds, which were transferred to the government.",
            "These, according to the lawsuits, are just a couple of the digital intrusions that the feds have linked to Kim Jong Un's crew. As explained in the court documents:",
            "This same group of notorious crypto crooks is believed to be responsible for the $234.9 million WazirX exchange hack. ®"
        ],
        "publishing_date": "2024-10-08 00:27",
        "keywords": [
            "Cybercrime",
            "Security"
        ]
    },
    {
        "title": "Epic judge orders Google to let rivals set up app stores",
        "url": "https://go.theregister.com/feed/www.theregister.com/2024/10/07/google_android_play_store_epic/",
        "body": [
            "A US court has ordered Google to refrain from a wide variety of business practices the web giant uses to bolster its Play Store, as a consequence of its December 2023 antitrust defeat against Epic Games.",
            "In that case, Epic argued that Google's Play Store rules and contractual agreements with developers and partners violated the federal Sherman Act and California's Unfair Competition Law (UCL). And the jury agreed.",
            "On Monday, US District Court judge James Donato issued a permanent injunction [PDF] that forbids Google from eight behaviors deemed unlawful as a result of the case.",
            "\"The jury found that Google's conduct violated the antitrust laws and substantially harmed competition in the relevant markets, and directly injured Epic,\" judge Donato wrote, explaining the injunction. \"The jury rejected Google’s proffered procompetitive justifications for its conduct. Consequently, the Court concludes that Epic has prevailed on the UCL claim against Google under the unlawful and unfair prongs.\"",
            "Noting that Google had \"fired a blunderbuss of comments and complaints that are underdeveloped and consequently unhelpful in deciding the issues,\" judge Donato put an end to the extensive input afforded to both sides about the specifics of the injunction that follows from the verdict.",
            "Google, in a blog post, unsurprisingly disagreed – it is appealing the verdict and will ask the courts to pause the injunction until its appeal is heard.",
            "\"These Epic-requested changes stem from a decision that is completely contrary to another court's rejection of similar claims Epic made against Apple – even though, unlike iOS, Android is an open platform that has always allowed for choice and flexibility like multiple app stores and sideloading,\" wrote Lee-Anne Mulholland, VP of regulatory affairs at Google.",
            "Mulholland argues that the court-ordered changes would hinder Google's – and the wider Android ecosystem's – ability to compete with Apple's ecosystem.",
            "The injunction is set to take effect starting November 1, 2024, only in the US, for a period of three years. During this time:",
            "The injunction also gives Epic and Google a 30-day deadline to form a three-person Technical Committee, comprising one representative from each party and a mutually agreed upon third member, to resolve disputes over the implementation of the injunction's provisions.",
            "Epic Games did not immediately respond to a request for comment. ®"
        ],
        "publishing_date": "2024-10-07 23:29",
        "keywords": [
            "Android",
            "Epic Games",
            "Google"
        ]
    }
]